{"AB0602": {"name": "COMMUNICATION MANAGEMENT STRATEGIES", "au": "  4.0", "program": "ACC", "mutually_exclusive": "AB214", "not_available": "ACBS(GA) 1, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 3, BCE 1, BCE 2, BCE 4, BCG 1, BCG 2, BCG 4, BUS 1, BUS 3, BUS(GA) 1, BUS(GB) 1, BUS(HRC) 2, BUS(THM) 2", "prerequisite": "AB114 OR AB0601", "grade_type": null, "description": "The purpose of this course is to prepare students for the communications challenges that are likely to be met in rapidly evolving global business environments. Its primary objective is to enable students to present themselves professionally not only in the way they speak and write, but also as confident participants in their chosen profession."}, "AB1601": {"name": "ORGANISATIONAL BEHAVIOUR & DESIGN", "au": "  3.0", "program": "ACC", "mutually_exclusive": "AB105, BU8601, CE8003, CPE184, CSC184, CZ8003, EE4041, MS2030, MS3030", "not_available": "ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE 2, BCE 3, BCE 4, BCG 2, BCG 3, BCG 4, BUS 2, BUS 3, BUS(GB) 1, CE, CSC, MS-2ndMaj/Spec(ITG), MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "description": "Organizations are an integral part of many people?s lives. This course provides a strong theoretical foundation that you can use to build a grounded understanding of organizational phenomena. In your study of organizational behavior, you will learn more about yourself, how to interact effectively with others, and how to thrive in organizations. You will gain insights about your personality, emotions, values, perceptions, and motivations. You will learn about being an effective collaborator, and how you can gain greater self-efficacy in managing conflict, negotiating, influencing, and leading others. You will also build skills in areas such as self-leadership, avoiding groupthink, coping with organizational politics, and managing stress. This course is designed to enable students to acquire a strong body of foundational knowledge about organizational behavior and develop key managerial competencies needed to work well with people."}, "AB3601": {"name": "STRATEGIC MANAGEMENT", "au": "  4.0", "program": "ACC", "mutually_exclusive": null, "not_available": "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACC(GA) 1, ACC(GA) 2, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE 1, BCE 2, BCE 3, BCG 1, BCG 2, BCG 3, BUS 1, BUS 2, BUS(HRC) 3, BUS(MKG) 3, BUS(THM) 3, MS-2ndMaj/Spec(MSB) 1", "prerequisite": "AB105 & AB112 OR AB1501 & AB1601 OR AB105 & AB1601 OR AB112 & AB1501", "grade_type": null, "description": "The Strategic Management Course focuses on identifying and understanding the sources of superior firm performance. This course introduces theoretical concepts and frameworks useful for analyzing the external and internal environment of the firm, and guiding the formulation and execution of different types of strategies. Strategic issues are examined from the perspective of a chief executive or general manager, focusing on how one can formulate effective strategies and develop the necessary resources and capabilities to achieve sustainable competitive advantage in a global and volatile competitive environment."}, "BS3348": {"name": "UAEB WORKSHOP - FIELD STUDIES IN FUNCTIONAL PLANT ECOLOGY", "au": "  3.0", "program": "BS", "mutually_exclusive": null, "not_available": null, "prerequisite": "BS3018 OR ES2303", "grade_type": null, "description": "This course aims to provide an opportunity for you to participate in a research intensive two week field course in functional plant ecology, held together with students and faculty from the Australian National University. Multiple field sites in Singapore and Malaysia (Endau Rompin) will be utilized. It will give you a good exposure to the rewards and challenges of fieldwork. In the course you will need to develop skills critical for any science related career, including literature research, the framing of hypotheses and carrying out mini-projects in groups."}, "BC2406": {"name": "ANALYTICS I: VISUAL & PREDICTIVE TECHNIQUES", "au": "  4.0", "program": "BUS", "mutually_exclusive": "BC3404", "not_available": "ACBS-2ndMaj/Spec(IT)(2014-onwards), ADM, AERO, ASEC, BCE 3, BCE 4, BCG 3, BCG 4, BEEC, BIE, BMS, BS, BSPY, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, ESPP, HIST, IEEC, IEM, LMS, MAEC, MAEO, MAT, MATH(AMAS), MATH(BA), MATH(PMAS), MATH(STAT), ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, REP, SOC, SSM", "prerequisite": null, "grade_type": null, "not_available_spec": "(Admyr 2004-2010)-Non Direct Entry, (Admyr 2004-2011)-Direct Entry", "description": "Most organizations are data rich and information poor. The large volumes of data in an organization are 'oilfields' rich in information content that are pending extraction with the right tools and models. Analytics involves the art of data exploration, visualization, communication and the science of analyzing large quantities of data in order to discover meaningful patterns and useful insights to support decision-making. The primary objective of this course is to introduce students to various techniques available to extract useful insights from the large volumes of data. At the end of the course, students will not only see the substantial opportunities that exist in the business analytics realm, but also learn techniques that allow them to exploit these opportunities. This course focus on the use of open source R software, which is one of the key analytics software used in various industries and a critical skillset required in the job market for analytics and data science professionals.1. Data Analytic Thinking2. Data Exploration3. Statistics for Analytics4. Data Structures5. Data Visualization6. Data Cleaning7. Data Imputation8. Linear Regression9. Classification and Regression Trees10. Clustering11. Text Mining"}, "BM2506": {"name": "DIGITAL MARKETING:CONNECTING WITH CUSTOMERS IN TODAY'S WORLD", "au": "  4.0", "program": "BUS", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course addresses marketing through digital media in the following aspects:1.\tFundamentals of digital marketing2.\tDigital marketing strategies and management 3.\tSocial media marketing4.\tIssues in implementing a digital marketing initiative"}, "BU8101": {"name": "ACCOUNTING: A USER PERSPECTIVE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1101, AC1101, AD1101, AD2101, EE0062, EE8062", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS(NULL), MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.Students will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.Topics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization."}, "BU8201": {"name": "BUSINESS FINANCE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB102, AB1201, MB102", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "This is an introductory course in finance for non-business and non-accounting students, which provides students with a broad understanding of the principles and practice of Business Finance/Financial Management.   The emphasis is on the major financial decisions made by companies and the valuation of investments made by them.  The course starts by examining the various forms of businesses and the importance of interest rates.  Time value of money, and the linkage between risk and return, lays the foundation for evaluating the price of bonds and stocks.  Students will learn and apply principles of capital budgeting (calculating the profitability of various projects and deciding which one to proceed) and capital structure (financing approved projects by issuing shares or bonds, or using retained earnings).  The decision to use extra cash to pay dividends or repurchase shares will be analysed and the course concludes with the use of derivatives to protect and enhance the value of firms.Students intending to take this course should be numerate (good and comfortable with mathematical calculations and formulas) e.g. they should know well compound interest calculations, Sum of Geometric Progression (G.P.) calculation before attending this course.  "}, "BU8301": {"name": "FUNDAMENTALS OF BUSINESS LAW", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB107, AB1301, MB107", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "The aim of this course is to provide a good understanding of the main principles of law affecting business. As an introductory course, it will cover the key principles and issues. The course will start with an introduction of the basic concepts and definitions relating to the law and the legal system in Singapore before focusing on several important areas of law: contract law, agency law, the law in relation to business organizations in Singapore and the law of tort."}, "BU8501": {"name": "MARKETING FOR THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB112, AB1501, MB103", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "This course is designed for students who have chosen to specialise in disciplines other than business. As students may already know, a working knowledge of marketing is rather useful wherever their career takes them. We will discuss the basic principles of marketing. However, the focus is on its practice and how this understanding could potentially enhance the students' future performance in their chosen field. A hands-on approach is expected of students and activities have been incorporated to encourage observation and enhance analytical ability. The course will require you to analyse businesses, lead discussions and present your analysis and recommendations on selected organisations."}, "BU8502": {"name": "MARKETING COMMUNICATIONS: AN INTEGRATED APPROACH", "au": "  3.0", "program": "BUS", "mutually_exclusive": "BM2504, CS2058, CS4035", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "Communication with the market is an important activity for many businesses and organizations. It is also relevant to us as consumers because we are exposed to hundreds of messages from marketers every day.This course is concerned with the development, implementation and evaluation of marketing communication activities.  The course primarily takes the marketer's perspective, requiring you to consider and critically evaluate factors influencing both the design and implementation of comprehensive, integrated marketing communication (IMC) programs.  In this course, we regard IMC as a system of thinking, processes and coordinated activities driven by the marketer's objectives. Adopting a global perspective, we draw illustrative examples and cases from different parts of the world and discuss issues faced by marketers in conducting IMC programs across countries. The course is designed to develop your logical thinking and creativity regarding IMC.  Although this course is oriented towards practice, we still cover theories and concepts that explain how marketing communication (marcom) practices work and their applicability.  Using these theories and concepts to analyse practices, you will be able to choose and design marcom activities judiciously, justify your choice, and appraise the effectiveness of the activities.Instead of treating IMC as a set of stand-alone tools or activities, the course regards it as a blended mix of coordinated activities.  The course put roughly equal emphasis on both traditional marcom tools (e.g., advertising and sales promotion) and non-traditional tools (e.g., search engine marketing and social media marketing).  The course compares the similarities and differences of these tools, and explains how they can work together for achieving the marketer's objectives.  While non-traditional marcom tools catch marketers' attention nowadays, traditional marcom tools are indispensable for particular purposes and under certain circumstances.   "}, "BU8542": {"name": "SOCIAL MARKETING - MAKING THE WORLD A BETTER PLACE", "au": "  3.0", "program": "BUS", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "Social marketing is the use of business marketing concepts and techniques to change behaviour for the betterment of society. The course is designed for students concerned about social issues and passionate about making a difference.  It exposes students to a myriad of social problems plaguing society and acquaints them with marketing concepts, tools and strategies to effect change. Students will work in teams to develop a social marketing campaign to address a social problem."}, "BU8544": {"name": "MARKETING HEALTH: CONSUMERS' PURSUIT OF WELLNESS", "au": "  3.0", "program": "BUS", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "The health, beauty, and wellness industry is predicted to have a strong growth in the coming years. With the disposable income and life expectancy increasing, many consumers are willing to spend considerable amount of income on seeking and keeping health and beauty. Healthy lifestyle has become a global trend with many health conscious followers. With the growing ageing population around the world, high quality healthcare services that provides patients a pleasant experience are in great demand. This course will provide an overview of conducting marketing in three sectors of the growing health industry: 1. Consumer health and beauty products/services (e.g. healthy foods, gym membership, sports apparel, slimming treatment services); 2. Healthcare services (e.g. services in hospitals, clinics, senior-living communities, pharmacies); and 3. Health and wellness tourism (e.g. travel for medical exam, medical spa, spiritual experiences, mind-body connection). The business environment of these sectors will be reviewed. Current trends, opportunities and challenges will be highlighted to help students learn and practice how to develop marketing strategy in these sectors. On the other hand, students as consumers will gain insights into their own pursuit of health, beauty, and wellness with a deeper understanding of the business landscapes of these sectors. Fundamental marketing concepts, principles, and frameworks will be reviewed to ensure that non-business students are also equipped with necessary marketing knowledge to work on the course assignments and projects."}, "BU8641": {"name": "CULTURAL INTELLIGENCE: HOW TO BE AN EXPLORER OF THE WORLD", "au": "  3.0", "program": "BUS", "mutually_exclusive": "BH331, BH3603", "not_available": "ACBS, ACC, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "We live in a global world, where a premium is placed on the ability to navigate and adapt to differences. Cultural intelligence, CQ is the capability to function effectively across national, ethnic and organizational, organizational cultures (Ang & Van Dyne). IQ and EQ are no longer enough, CQ is becoming a critical predictor for success in the borderless world of the 21st century. The good news is that CQ can be developed and learnt by almost anyone. This course will focus on providing students a conceptual framework for CQ, as well as a set of tools to navigate and explore the world.At the end of the course, students can expect the following outcomes:-(1)\tA greater understanding of their own motivation, culture, values, and personality, as well         as their CQ strengths and weaknesses (CQ Motivation & Strategy) (2)\tKnowledge and experience of how cultures differ in values and behaviours, and how to         capitalize on similarities, and leverage on the differences (CQ Knowledge); (3)\tEnhanced awareness and efficacy of your own communication style in cross cultural         contexts (CQ Behaviour)Teaching Method: Highly experiential and focused on learning from own self-reflection, class activities and group work, this course focuses on bringing conceptual knowledge to life. "}, "BU8642": {"name": "LEADERSHIP IN THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB9602, BH333", "not_available": "ACBS, ACC, BCE, BCG, BUS", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "Leadership is a hot topic in corporations, government agencies, and non-profit organizations. But what do leaders really do in the world of work? What do YOU need to do in order to be a really effective leader? This course is for students who hope to become managers, leaders or consultants in workplaces anywhere in the world.The course covers some important non-textbook principles for organizational leadership, with an emphasis on both and \"eastern\" and \"western\" approaches to leadership. You will learn practical skills and techniques for networking, teamworking, managing and leading people at work (eg., setting goals, delegating work, conducting a staff meeting, coaching employees, impressing various stakeholders). The assessment will actually be fun and will provide further learning for you! It involves a real world project, some independent research into leadership concepts, and self-reflection on your own leadership style. Weekly seminars will involve lots of discussions, roleplays, and group activities, so be prepared to experience many aspects of leadership for real!"}, "CF9001": {"name": "CHINESE LANGUAGE & CULTURE STUDIES", "au": "  3.0", "program": "CI", "mutually_exclusive": null, "not_available": null, "prerequisite": "No prior knowledge of the Chinese language", "grade_type": null, "description": "The language part of the course is suitable for non-native speakers who wishes to gain an insight into the Chinese Language. The course contents are designed to help you build Chinese vocabulary and basic conversational skills for daily usage.The Chinese cultural studies course aims to expose you to the intriguing aspects of Chineseculture through classroom sessions, hands-on learning and visits to places of interest with Chinese cultural significance.Course content1. Chinese Language2.\tCultural Studies:a. The Chinese Communities in Southeast Asia; b.Chinese Ink Painting: The Aesthetic Perspective3. Introduction of the Chinese Paper Cutting and the Chinese Culture4. Introduction of the Chinese Seal Engraving5. Introduction of the Traditional Chinese Medicine (TCM)"}, "CS2400": {"name": "FOUNDATION OF INFORMATION ANALYTICS", "au": "  3.0", "program": "CS", "mutually_exclusive": "CS4036", "not_available": null, "prerequisite": null, "grade_type": null}, "Not available as Core to Programme: ": {"name": "CS(2004-2015)", "au": null, "program": null, "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "Learning ObjectiveThis course will introduce you to the statistical foundations of data science and information analytics for handling of massive databases.  The course covers the statistical concepts required for big data analytics, and introduces you to statistical tests and statistical modeling.ContentImportance of Statistics; Descriptive Statistics; Probability; Counting Techniques; Discrete Probability Distributions; Normal Distribution; Confidence Intervals; Hypotheses Testing for one Population; Hypotheses Testing for two Populations; Correlation and Linear Regression; Non-linear Regression; Application of Statistics to Data Analytics"}, "CZ1003": {"name": "INTRODUCTION TO COMPUTATIONAL THINKING", "au": "  3.0", "program": "CSC(CE)", "mutually_exclusive": "BG2211, BS1009, CH2107, CV1014, EE1005, MA1008, MS1008, PS0001, RE1016", "not_available": "AERO(2018-onwards)(Non Direct Entry), AERO(2019-onwards)(Direct Entry), ASEC(2018-onwards), BCE, BCG(2004-2010), BEEC(2018-onwards), BIE(2018-onwards)(Non Direct Entry), BIE(2019-onwards)(Direct Entry), BMS(2018-onwards), BS(2018-onwards), BSB(2018-onwards), BSPY(2018-onwards), CBE(2018-onwards)(Non Direct Entry), CBE(2019-onwards)(Direct Entry), CBEC(2018-onwards), CE, CEE(2018-onwards)(Non Direct Entry), CEE(2019-onwards)(Direct Entry), CEEC, CHEM(2018-onwards), CSC(2004-2010), CSEC(2004-2010), CVEC(2018-onwards), EEE(2018-onwards)(Non Direct Entry), EEE(2019-onwards)(Direct Entry), EEEC(2018-onwards), EESS(2018-onwards), ENE(2018-onwards)(Non Direct Entry), ENE(2019-onwards)(Direct Entry), ENEC(2018-onwards), ENG(2018-onwards), ENG(CEE)(2018-onwards), ENG(EEE)(2018-onwards), ENG(ENE)(2018-onwards), ENG(ME)(2018-onwards), ESPP(2018-onwards), IEEC(2018-onwards), IEM(2018-onwards)(Non Direct Entry), IEM(2019-onwards)(Direct Entry), MAEO(2018-onwards), MAT(2018-onwards)(Non Direct Entry), MAT(2019-onwards)(Direct Entry), MATH(2018-onwards), ME(2018-onwards)(Non Direct Entry), ME(2019-onwards)(Direct Entry), ME(DES)(2018-onwards)(Non Direct Entry), ME(DES)(2019-onwards)(Direct Entry), ME(RMS)(2018-onwards)(Non Direct Entry), ME(RMS)(2019-onwards)(Direct Entry), MEEC(2018-onwards), MS(2018-onwards), MS-2ndMaj/Spec(MSB)(2018-onwards), MTEC(2018-onwards), PHY(2018-onwards), REP(2018-onwards)", "prerequisite": null, "grade_type": null, "description": "Computational thinking (CT) is a problem solving process with the aid of computer; i.e. formulating a problem and expressing its solution in such a way that a computer can effectively carry it out. It includes a number of characteristics, such as breaking a problem into small and repetitive ordered steps, logically ordering and analyzing data and creating solutions that can be effectively implemented as algorithms running on computer. As such, computational thinking is essential not only to the Computer Science discipline, it can also be used to support problem solving across all disciplines, including math, science, engineering, business, finance and humanities. The aim of this course is hence to take students with no prior experience of thinking in a computational manner to a point where they can derive simple algorithms and code the programs to solve some basic problems in their domain of studies. In addition, the course will include topics to appreciate the internal operations of a processor, and raise awareness of the socio-ethical issues arising from the pervasiveness of computing technology."}, "CZ1016": {"name": "INTRODUCTION TO DATA SCIENCE", "au": "  3.0", "program": "CSC(CE)", "mutually_exclusive": null, "not_available": null, "prerequisite": "CZ1003 OR CE1003", "grade_type": null, "description": "This course will start with the core principles of Data Science, and will equip you with the basic tools and techniques of data handling, exploratory data analysis, data visualization, data-based inference, and data-focussed communication. The course will also introduce you to the fundamentals of Machine Learning - prediction, classification, clustering, anomaly detection - to set the computational framework for Data Science. The goal is to motivate you to work closely with data and make data-driven decisions in your field of study. The course will also touch upon ethical issues in Data Science and motivate you to explore the cutting-edge applications related to Big Data, Neural Networks and Deep Learning. Python will be the language of choice to introduce hands-on computational techniques."}, "EE1002": {"name": "PHYSICS FOUNDATION FOR ELECTRICAL & ELECTRONIC ENGINEERING", "au": "  4.0", "program": "EEE", "mutually_exclusive": "CY1306, EE2091, FE1002, PH1105, PH1106, PH116S", "not_available": null, "prerequisite": "FE1011 OR FE1012 OR FE0001 OR PH1011 OR PH1012", "grade_type": null, "not_available_spec": "", "description": "Introduction of electromagnetic fields and applications, Electromagnetic in electronics, circuits and communications.  Introduction to light and principles of geometric optics.  Principles of wave optics.   Introduction to quantum physics and applications.  Applications of quantum physics in electronics and lasers."}, "EE2010": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2004", "not_available": null, "prerequisite": "FE1006 & FE1007 OR MATH1A & MATH1B OR EE2092 OR MH1810 & MH1811 OR FE1006 & MH1811 OR FE1007 & MH1810 OR MH2810 OR CY1601 & CY1602", "grade_type": null, "not_available_spec": "", "description": "Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "EE3002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "E314, IM2002, M473, MP3006", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": ""}, "Not available as UE to Programme: ": {"name": "CE, CSC", "au": null, "program": null, "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "EE4483": {"name": "ARTIFICIAL INTELLIGENCE & DATA MINING", "au": "  3.0", "program": "EEE", "mutually_exclusive": "E483N, IM4483", "not_available": null, "prerequisite": null, "grade_type": null, "description": "Problem Solving Techniques. Machine learning and Application to Data Mining."}, "EE8084": {"name": "CYBER SECURITY", "au": "  3.0", "program": "EEE", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "LEARNING OBJECTIVE - The objective of this course is to provide students with basic appreciation and understanding of the underlying security issues and implications of the use of various networked systems and electronic devices in the modern cyber-society from both user and management perspectives. Topics to be covered include overview of information systems and devices in a global network environment, threats to information systems and devices, security models, and concepts for secrecy, integrity and availability. Other topics of security concerns will also be explored: evaluations of secure information systems, security requirements analysis, security management policies, security trends and emerging technologies. CONTENT - Introduction to Cyber Crimes and Security Issues in a Cyber-environment. Digital Liability Management. Security Planning and Management. Security Solutions and Technologies. Web Security and Electronic Payment Models. Security Applications and Cases."}, "MA2071": {"name": "LABORATORY EXPERIMENTS (ME)", "au": "  1.0", "program": "ME", "mutually_exclusive": "AE2071, AE2072, MA2072, MP2071, MP2072", "not_available": "AERO, ASEC", "prerequisite": null, "grade_type": null, "not_available_spec": "", "description": "The 10 experiments consist of:E2.1\tEffects of cutting parameters on surface roughness of turned parts  E2.2 \tStudy of fan performance using dimensional analysisE2.3 \tEnergy balance in a compressorE2.4 \tDimensional measurement of componentsE2.5 \tTwo-dimensional strain measurementE2.6 \tFrictional losses in pipes and fittings E2.7 \tRefrigeration cycle experiment E2.8 \tNon-destructive testing E2.9 \tBalancing of rotating masses E2.10\tTorsion of cylindrical shaftsFor the 10 experiments, each student will submit nine log-sheets (on the same day) and one Technical Report (within 1 week)."}, "MA3071": {"name": "ENGINEERING EXPERIMENTS (ME)", "au": "  1.0", "program": "ME", "mutually_exclusive": "MA3072, MP3071, MP3072, MP3073", "not_available": "AERO, ASEC", "prerequisite": null, "grade_type": null, "not_available_spec": "", "description": "Code\tTitleP3.1\tUnsymmetric BendingP3.2\tBehaviour of Composite BeamP3.3\tStiffness and strength of Irregular-shaped BeamP3.4\tUltimate Load.Of A Beam Under Bending P3.5\tMachine Vibration analysis and Fault RecognitionP3.6\tVibration Testing.Of Multiple..DOF SystemsP3.7\tControl Of VibrationP3.8\tVibration Of A 4 Cylinder EngineP3.9\tCAD/CAM and CNCP3.10\tPlastic Injection MouldingP3.11\tThermo-formingP3.12\tDesign for manufacture and assemblyP3.13\tPerformance evaluation of milling operationsP3.14\tEvaluation of surface finish produced by various methodsP3.15\tProduct disassemblyP3.16\tDesign and construction of an analogue PID controllerP3.17\tReal Time Control & AI Prog of robot beetleP3.18\tMotion control of a ball screw systemP3.19\tA study of servo-hydraulic systemP3.20\tLiquid level controlP3.21\tStudy of industrial motor characteristicsP3.22\tCombined heat transfer by free convection and radiationP3.23\tGas TurbineP3.24\tFlow over an aerofoil sectionP3.25\tCompressible flowP3.26\tFan Characteristics for differP3.27\tThermal radiation unitP3.28\tForced convection in tubesP3.29\tConvective Heat TransferP3.30\tFilm and dropwise condensationE3.1\tDynamic Vibration AbsorberE3.2\tVibration of a 2-DOF SystemE3.3\tComputer Modelling, Simulation and Control of an Electromechanical SystemE3.4\tControl Of A Dc ServomotorE3.5\tHeat ExchangerE3.6\tTransient Heat Conduction"}, "MA9030": {"name": "BIOPRINTING: PRINCIPLES & APPLICATIONS", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "The course starts with introduction to tissue engineering and scaffolds for tissue engineering. Various bioprinting processes will be explained and the materials for bioprinting will be introduced. The students will also learn about cell sources and 3D cell culture techniques. Other topics include computational design and simulation in bioprinting. The students will attend a workshop on bioprinting to be exposed to the operation of a bioprinter. There will be also a group discussion session for the students to critically analyze the research field of bioprinting from their point of view. "}, "MA9031": {"name": "3D PRINTING & ADDITIVE MANUFACTURING:PRINCIPLES&APPLICATIONS", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide a general understanding of Additive Manufacturing or 3D Printing as it is more commonly known.  It starts with an introduction and the importance of 3D Printing and describes the process chain.The course will equip the students with all the 3D printing systems and technologies, their pros and cons.  It will also cover the file format used in 3D printers. More importantly, a comprehensive range of applications and case studies will be covered. Finally, benchmarking, growth and trends will be described."}, "MA9034": {"name": "MANAGING COMPLEX SYSTEMS PROJECTS", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course introduces the background and challenges of managing complex systems projects. These challenges include the global shortage of qualified and capable project and program managers to meet national development needs in implementing infrastructure, industrial and defence projects.The course first looks into the fundamental differences between a complex engineered system project and a non-complex or complicated one. To deal with the challenges, the course explores the need for different mindsets, capabilities, and a new set of theories, framework and approaches, in learning about and coping with complexity, uncertainties and emergent risks.  The importance of adopting systems thinking and systems engineering approaches will be emphasized in dealing with complex emergent issues and associated problems solving approach including complexity mapping and leadership. Case studies on large engineering and infrastructural systems projects will be used to develop a deeper appreciation and understanding of the real-world challenges involved.  Managing Complex Systems Projects also acknowledges the interdependency between the disciplines of systems engineering and project management. "}, "AAA18E": {"name": "DRAWING", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AAA184", "not_available": "ARED, SCED", "prerequisite": "Students are req to purchase approx $60 of Art materials", "grade_type": null, "description": "This course introduces drawing at a basic level through developing various first hand observation skills. Students will create a range of drawings from portraits to still life depictions. Students will learn skills in measuring, proportion, tone, volume, negative space etc.  By the end of this course, students will develop a competency in making drawings with a degree of accuracy to what is being observed. Attendance is a requirement as there are continual and formative assessments."}, "AAA18J": {"name": "PAINTING WITH WATERCOLOUR", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AAA186", "not_available": "ARED, SCED", "prerequisite": "Students are req to purchase approx $60 of Art materials", "grade_type": null, "description": "This course aims to highlight the beauty and ephemeral qualities of watercolour painting. Students will be progressively taught various techniques to achieve different results. There will be an emphasis on hands-on practice as well as keynotes on how to appreciate the visual qualities of watercolour paintings. Students will first be taught basic drawing and paintings skills, after which students are encouraged to take a more experimental and gestural approach to watercolour painting.Attendance is a requirement as there are continual and formative assessments."}, "AAA28D": {"name": "ARTS ACROSS THE BORDERS", "au": "  3.0", "program": "NIE", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "A study focused on the discovery and understanding of the artistic heritage, psychogeography and socio-cultural significances of a specific part of Singapore. For 2005, the site chosen will be the very vibrant and colourful area of Joo Chiat/ Katong.  \"Borders\" in this sense may comprise the historic, contemporary, architectural, cultural, social, political, psychic and imaginary boundaries that define every day life in the area. A considerable part of the course will be spent doing experiential work (maps, photography, video itself). Course work will involve comprising Situationist-inspired interventions that take as starting point the ways that this particular quarter and its inhabitants perform."}, "AAR23C": {"name": "FILM STUDIES", "au": "  3.0", "program": "NIE", "mutually_exclusive": "HL3001", "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide an introduction to film appreciation and analysis. As this course is offered by the English Language and Literature Academic Group, the focus of the course is on film as a construct of art and narrative, paying particular attention to aspects of film form, aesthetics and style. Due to the constraints of time, we will study primarily contemporary feature films from the year 2000.The course is divided into two parts. Part One introduces the four elements of film namely mise-en-scene, cinematography, editing and sound that provide the basic vocabulary of film studies. Part Two studies filmic texts as visual forms of story-telling and explores the issues of representation and spectatorship."}, "AED28B": {"name": "CRITICAL PERSPECTIVES ON EDUCATION", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AED105", "not_available": "ARED, SCED", "prerequisite": "Must attend both lectures and tutorials", "grade_type": null, "description": "This course takes a multi-disciplinary approach to expose student teachers to the broad concerns and challenges in contemporary educational thought and practice. Topics include the history and philosophy of education, contemporary beliefs about the values and purpose of education as well as issues dealing with curriculum and pedagogy. The course will also explore the challenges of dealing with issues like inequality and elitism. These topics and issues will be rigorously examined with a view to stimulating individual reflection and class discussion. In the process of exploring these issues student teachers will be encouraged to reflect on what it takes in terms of skills, knowledge, and attitude to become a good teacher."}, "ET9131": {"name": "ENTREPRENEURSHIP &  MARKETING FOR NEW VENTURES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9101, ET9121, RE8001", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": " Yr4", "description": "This is the module that introduces students to the concepts of entrepreneurship. The goal of this course is to provide students with essential information on the entrepreneurial process. The focuses of the course are on business concept development and feasibility analysis to assess the viability of the concept. The course includes concepts of entrepreneurship, creativity, innovation, and new venture creation process. Students will learn to generate ideas, identify opportunities and investigate whether it can be turned into a viable business through feasibility analysis.  Entrepreneurial marketing will be given emphasis in this module as it is one of the important factors in feasibility analysis. Concepts such as product positioning, market segmentation, Michael Potter?s five forces of industry structure and SWOT (Strength, weakness, Opportunity and Threat) will be introduced. Students will also learn to select, develop, and evaluate new products / services, set prices to maximize profitability and make the most efficient use of public relations, publicity during product launches and initial rollouts. "}, "ET9132": {"name": "ENTREPRENEURIAL ACCOUNTING AND FINANCE", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9102", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": " Yr4", "description": "Entrepreneurs need money to start and to grow their business. It is important for entrepreneurs to understand how revenue is generated, how to source for funds, how to control cash flow, how to assess the success of the company in monetary terms, and how to value a company for various purposes. These and other issues are covered in this module. For the foundation, the basic accounting concepts will be introduced, followed by financial concepts and tools relevant to entrepreneurs. "}, "ET9133": {"name": "MANAGING GROWING ENTERPRISES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9103", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": " Yr4", "description": "The start-up and growth of an enterprise invariably involves both human and financial capital. To manage the increasing pool of human resources and to convince venture capitalists to invest become two main issues especially for growing ventures. This module consists of two parts: in the first part, organization and human resource management are introduced; in the second part, the focus is on writing a convincing business plan to attract venture capital investment. "}, "ET9134": {"name": "ENTERPRISE STRATEGY", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9104, RE8009", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": " Yr4", "description": "This is an immersive experiential learning module. An online business simulator is used as a platform to let students experience the process of managing a business through the virtual media. Students are exposed to some of the major business decisions that entrepreneurs face when growing their ventures and competing with other companies in the same industry. Students are grouped into teams and the teams will compete with one another. As students work through the organization's life cycle in the simulation, external forces and managerial dilemmas are added.  Students will apply the various tools, case-studies and theories from previous modules as the new venture expands its operations and subsequently tackle new tasks, take on additional responsibilities and make difficult decisions."}, "HA2017": {"name": "FOREIGN POLICY ANALYSIS", "au": "  3.0", "program": "PPGA(SSS)", "mutually_exclusive": null, "not_available": null, "prerequisite": "HA2004", "grade_type": null, "description": "The course is divided in two parts. The first part provides and historical background and overview of foreign policy analysis theoretical perspectives (realism, liberalism and constructivism) and how it relates to International Relations. The second part focuses on the various factors and components that influence and shape decision making in foreign policy, namely actors, structures, media and public opinion, various models, implementation strategies and instruments, economic statecraft, national security and transnational issues considerations. Each unit will include analysis and practical exercises of concrete foreign policy case studies."}, "LM9001": {"name": "MALAY LANGUAGE LEVEL 1", "au": "  3.0", "program": "SOH", "mutually_exclusive": "HMM1", "not_available": null, "prerequisite": "No previous knowledge of the language", "grade_type": null, "description": "The course covers: The pronunciation system, basic language patterns and essential vocabulary (words and phrases ) to achieve basic competence in listening, speaking, reading and writing skills; Study of dialogues and graded readings covering common and everyday practices aimed at providing some insight into Malay culture; Basic communication skills such as understanding and conveying simple messages and ideas through lessons on greetings and meeting people, telling of time, numerals, colours and nature; and Writing of postcards, e-mail and beginners' composition in the form of paragraphs.This course is tailored for new learners who do not have any prior knowledge of the Malay Language. A Placement test or interview is required for all Malaysian and Indonesian students, including those whose parent(s) are Malaysian or Indonesian."}}