{"AB3601": {"name": "STRATEGIC MANAGEMENT", "au": "  4.0", "program": "ACC", "mutually_exclusive": null, "not_available_to_program": "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACC(GA) 1, ACC(GA) 2, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE 1, BCE 2, BCE 3, BCG 1, BCG 2, BCG 3, BUS 1, BUS 2, BUS(AWM) 3, BUS(HRC) 3, BUS(MKG) 3", "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "AB1501 & AB1601", "grade_type": null, "description": "The Strategic Management Course focuses on identifying and understanding the sources of superior firm performance. This course introduces theoretical concepts and frameworks useful for analyzing the external and internal environment of the firm, and guiding the formulation and execution of different types of strategies. Strategic issues are examined from the perspective of a chief executive or general manager, focusing on how one can formulate effective strategies and develop the necessary resources and capabilities to achieve sustainable competitive advantage in a global and volatile competitive environment."}, "AD2101": {"name": "MANAGEMENT ACCOUNTING", "au": "  4.0", "program": "BUS", "mutually_exclusive": "AB1102, BU8101", "not_available_to_program": "ACBS, ACC, ADM, AERO, ARED, ASEC, BCE 1, BCE 2, BCE 3, BCE 4, BCG 1, BCG 2, BCG 3, BCG 4, BEEC, BIE, BMS, BS, BSB, BSPY, BUS 3, BUS(ACS) 2, BUS(AWM) 2, BUS(BA) 2, BUS(BAF) 2, BUS(ITT) 2, BUS(PBL) 2, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON-2ndMaj/Spec(NULL), ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, ESPP, IEEC, IEM, LMS, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS(ITG), MS-2ndMaj/Spec(ITG), MS-2ndMaj/Spec(MSB) 2, MS-2ndMaj/Spec(NULL), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "not_available_to_program_with": "(Admyr 2004-2013), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(ITG)", "not_available_as_core_to_program": null, "prerequisite": "AD1101 OR AB1101", "grade_type": null, "description": "This course introduces managerial accounting at an introductory level. a.\tThe changing role of management accounting in a dynamic business environmentb.\tBasic cost concepts and costing techniquesc.\tRelevant costs and decision makingd.\tStandard costing, budgeting and performance measuremente.\tDecentralization and responsibility accountingf.\tStrategic management accounting and business sustainability"}, "BU8101": {"name": "ACCOUNTING: A USER PERSPECTIVE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1101, AC1101, AC1103, AD1101, AD2101, EE0062, EE8062", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS, MS-2ndMaj/Spec(MSB)", "not_available_to_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.Students will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.Topics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization."}, "BU8201": {"name": "BUSINESS FINANCE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1201", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is an introductory course in finance for non-business and non-accounting students, which provides students with a broad understanding of the principles and practice of Business Finance/Financial Management.   The emphasis is on the major financial decisions made by companies and the valuation of investments made by them.  The course starts by examining the various forms of businesses and the importance of interest rates.  Time value of money, and the linkage between risk and return, lays the foundation for evaluating the price of bonds and stocks.  Students will learn and apply principles of capital budgeting (calculating the profitability of various projects and deciding which one to proceed) and capital structure (financing approved projects by issuing shares or bonds, or using retained earnings).  The decision to use extra cash to pay dividends or repurchase shares will be analysed and the course concludes with the use of derivatives to protect and enhance the value of firms.Students intending to take this course should be numerate (good and comfortable with mathematical calculations and formulas) e.g. they should know well compound interest calculations, Sum of Geometric Progression (G.P.) calculation before attending this course.  "}, "BU8501": {"name": "MARKETING FOR THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1501", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course is designed for students who have chosen to specialise in disciplines other than business. As students may already know, a working knowledge of marketing is rather useful wherever their career takes them. We will discuss the basic principles of marketing. However, the focus is on its practice and how this understanding could potentially enhance the students' future performance in their chosen field. A hands-on approach is expected of students and activities have been incorporated to encourage observation and enhance analytical ability. The course will require you to analyse businesses, lead discussions and present your analysis and recommendations on selected organisations."}, "HC4014": {"name": "SPECIAL TOPICS IN CHINESE LITERARY & CULTURAL STUDIES", "au": "  4.0", "program": "CHIN(SOH)", "mutually_exclusive": null, "not_available_to_program": "ACBS, ACC, AERO, ARED, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CSC, CSEC, CVEC, DSAI, EEE, EEEC, EESS, ENE, ENEC, ENG, IEEC, IEM, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHY, REP, SCED, SSM", "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": "HC1001", "grade_type": null, "description": "The course discusses issues in Chinese literature and culture through the introduction of special topic(s). The topics are decided by the teacher in charge based on his/her expertise. The course includes lectures, small group presentation, and in class discussion."}, "HC4041": {"name": "CHINA & ASEAN", "au": "  4.0", "program": "CHIN(SOH)", "mutually_exclusive": null, "not_available_to_program": "ACBS, ACC, AERO, ARED, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CS, CSC, CSEC, CVEC, DSAI, EEE, EEEC, EESS, ENE, ENEC, ENG, IEEC, IEM, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHY, REP, SCED, SSM", "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": "HC2005", "grade_type": null, "description": "This subject examines the dynamics between China and the Association of Southeast Asian Nations (ASEAN) as a whole as well as its member countries.  It looks at the changing China-ASEAN perception and relations from the political, economic, social, and cultural dimensions.  Discussion includes such issues as diplomatic relations, political order, security, trade, investment, people interaction, and cultural exchanges."}, "CS4037": {"name": "AUDIENCE RESEARCH METHODS", "au": "  4.0", "program": "CS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": "CS2008 OR HP1100 (Applicable to PSMA)", "grade_type": null, "description": "This course is designed to provide students with tools to study audience characteristics and the impact of communication on receivers. The course centers around two research methods that are widely used by academics and practitioners: survey research and focus group study. Students will learn how to design, plan and implement these two types of studies. They will also learn how to analyse data and present the findings in both oral and written formats."}, "CS4053": {"name": "POPULAR CINEMA", "au": "  4.0", "program": "CS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course introduces students to the different genres of contemporary popular global cinemas. In addition to Hollywood feature films, students will study non-Hollywood contemporary films that have proven successfully at the box offices either internationally and/or in their countries of production in order to study the critical elements that have contributed to the success of these films. Students will be exposed to box office hits from a wide variety of countries such as Spain, the UK, Japan, Korea, India and Australia. The analysis of these popular films will be contextualised in relation to relevant film theories such as genre theory, audience reception theories, studies of the economic development of new cinematic industries and the impact of global film distribution."}, "CZ2004": {"name": "HUMAN COMPUTER INTERACTION", "au": "  3.0", "program": "CSC(CE)", "mutually_exclusive": null, "not_available_to_program": "BCE, CE, REP(ASEN), REP(BIE), REP(CBE), REP(CE), REP(CVEN), REP(EEE), REP(ENE), REP(MAT), REP(ME)", "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction; Usability and application spaces; Guidelines and principles for text-based interactions; Hardware devices for interaction; Development processes and assessments; Software tools in user interface development; Interaction styles;  Practical UI development concepts; Design Issues"}, "EE1002": {"name": "PHYSICS FOUNDATION FOR ELECTRICAL & ELECTRONIC ENGINEERING", "au": "  4.0", "program": "EEE", "mutually_exclusive": "CY1306, EE2091, FE1002, PH1105, PH1106, PH116S", "not_available_to_program": null, "not_available_to_program_with": "", "not_available_as_core_to_program": null, "prerequisite": "PH1011 OR PH1012", "grade_type": null, "description": "This course aims to build a strong foundation in the relevant physics principles used in the design of common electrical and electronic devices. The course builds on the concepts learned in the common engineering curriculum's first semester physics course. This course focuses on fundamental concepts that are key to EEE students in preparation for subsequent studies, and are utilized daily by electrical and electronics engineering professionals. You will learn the relationship between physics concepts and their applications in EEE. Contents: Introduction of electromagnetic fields and applications. Electromagnetic in electronics, circuits and communications. Introduction to light and principles of geometric optics. Principles of wave optics. Introduction to quantum physics and applications. Applications of quantum physics in electronics and lasers."}, "EE1005": {"name": "FROM COMPUTATIONAL THINKING TO PROGRAMMING", "au": "  3.0", "program": "EEE", "mutually_exclusive": "CE1003, CV1014, CZ1003, FE1008, MA1008", "not_available_to_program": null, "not_available_to_program_with": "", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "Course Overview and Concepts of Computational Thinking.  Overview of Programming Languages. Computers and Programming.  Overview of a Computer Program and Data Types. CT to Programming Concept - Operations and Reusable Functions. CT to Programming Concept - Decision Making and Repetition. CT to Programming Concept - Functions and Decomposition to Smaller Modules. CT to Programming Concept - Advanced Data Structures.  Computing Trends.  Social-Ethical Issues and Ramifications of Computing. "}, "EE2002": {"name": "ANALOG ELECTRONICS", "au": "  4.0", "program": "EEE", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "EE2001", "grade_type": null, "description": "Diode circuit analysis.   Bipolar junction transistors. MOSFET devices. Small-signal amplifiers. Multistage and differential amplifiers. Current Sources and Current Mirrors. Frequency response.  Operational amplifiers. Applications."}, "EE2007": {"name": "ENGINEERING MATHEMATICS II", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2007", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MH1811 OR MH2810 OR CY1602", "grade_type": null}, "Not available as UE to Programme: ": {"name": "CE, CSC", "au": null, "program": null, "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "EE2008": {"name": "DATA STRUCTURES & ALGORITHMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM1001", "not_available_to_program": "REP(ASEN), REP(BIE), REP(CBE), REP(CE), REP(CSC), REP(CVEN), REP(ENE), REP(MAT), REP(ME)", "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to give a systematic introduction to data structures and algorithms for constructing efficient computer programs. Emphasis is on data abstraction issues in program development process, and on the design of efficient algorithms. Simple algorithmic paradigms such as greedy algorithms, divide-and-conquer algorithms and dynamic programming will be introduced. Elementary analyses of algorithmic complexities will also be taught. Contents: Introduction. Principles of algorithm analysis. Data structures. Search Trees. Sorting. Searching. Algorithm design techniques."}, "EE2010": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2004", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MH1810 & MH1811 OR MH2810 OR CY1601 & CY1602", "grade_type": null, "description": "Through this course, students should be able to understand the representation of continuous-time and discrete-time signals; their frequency characteristics and Fourier spectrum; representation and characteristics of linear time-invariant systems in both time and frequency domains; and the principles of sampling a continuous-time signal to yield a discrete-time one. Contents: Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "EE3001": {"name": "ENGINEERING ELECTROMAGNETICS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "PH2102", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "EE2007(Corequisite)", "grade_type": null, "description": "This course aims to develop your understanding of the fundamental principles underlying the theory of electromagnetic fields and waves and your ability to apply this theory to the solution of engineering problems, e.g. solving fields, charges, currents and voltages in electrostatic, magnetostatic and electromagnetic problems. Contents: Static electric and magnetic fields. Maxwell's equations. Wave equation and uniform plane waves. Electromagnetic energy transfer. Reflection of electro-magnetic waves. Transmission lines."}, "EE3002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2002, MP3006", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null}, "EE3080": {"name": "DESIGN & INNOVATION PROJECT", "au": "  2.0", "program": "EEE", "mutually_exclusive": "EE2079, IM3080", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "EEE3 standing", "grade_type": null, "description": "The aim of the Design and Innovative Project module is to introduce you to design, prototype and test electrical and electronic engineering projects. It provide you an opportunity to exercise your creative and innovative ideas in a group project environment and excite the imagination of aspiring engineers, innovators and technopreneurs.Contents: Project Charter. Lectures on project management. Design and prototype development. Testing and instrumentation. Project report. Oral Presentation. Demonstration. DIP Competition."}, "HL3090": {"name": "SPECIAL TOPICS IN LITERATURE II", "au": "  3.0", "program": "ELH(SOH)", "mutually_exclusive": null, "not_available_to_program": "ACBS, ACC, AERO, ARED, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CSC, CSEC, CVEC, DSAI, EEE, EEEC, EESS, ENE, ENEC, ENG, IEEC, IEM, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHY, REP, SCED, SSM", "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": "HL1001", "grade_type": null, "description": "You will develop a comprehensive understanding of the textual and theoretical issues raised in the course, and will develop appropriate analytical skills in the process."}, "HH4091": {"name": "SPECIAL TOPICS IN HISTORY- INTERDISCIPLINARY HISTORY", "au": "  4.0", "program": "HIST(SOH)", "mutually_exclusive": null, "not_available_to_program": "ACBS, ACC, AERO, ARED, ASEC, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CS, CSC, CSEC, CVEC, DSAI, EEE, EEEC, EESS, ENE, ENEC, ENG, IEEC, IEM, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHY, REP, SCED, SSM", "not_available_to_program_with": " Yr1", "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course examines the important history of women and medicine in China by focusing on one of the most prominent areas: women's reproductive health. It discusses how a variety of actors conceptualized, discussed, constructed, or even contested Chinese women's reproductive health and bodies from the imperial period to the twentieth century. Employing a thematic rather than a chronological approach, this course covers a series of prominent themes related to women's reproduction, ranging from theorizations of the female reproductive body in classic works, to pragmatic and scientific practices in managing reproductive ailments such as menstruation, miscarriage, childbirth, and prenatal and postpartum care. This course also analyzes the important role that science and technology played in the development of women's reproductive health. Through a focused study on women's reproductive health in the Chinese context, this course aims to equip students with historical knowledge, critical thinking abilities, and analytical skills to reflect on issues about women, medicine, and science in other cultural and national contexts. "}, "IM1001": {"name": "DATA STRUCTURES & ALGORITHMS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2008", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to give a systematic introduction to data structures and algorithms for constructing efficient computer programs. Emphasis is on data abstraction issues in program development process, and on the design of efficient algorithms. Simple algorithmic paradigms such as greedy algorithms, divide-and-conquer algorithms and dynamic programming will be introduced. Elementary analyses of algorithmic complexities will also be taught.Course content: Introduction. Principles of Algorithm Analysis. Data Structures. Search Trees. Sorting. Searching. Algorithm Design Techniques."}, "IM2002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE3002, MP3006", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "IM2004": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2010", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "IM2092 OR MH1810 & MH1811 OR MH2810", "grade_type": null, "description": "Through this course, students should be able to understand the representation of continuous-time and discrete-time signals; their frequency characteristics and Fourier spectrum; representation and characteristics of linear time-invariant systems in both time and frequency domains; and the principles of sampling a continuous-time signal to yield a discrete-time one.Course content: Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "IM2007": {"name": "ENGINEERING MATHEMATICS II", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2007", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MH1811 OR MH2810", "grade_type": null, "description": "Linear Algebra. Complex Variables. Vector Differential Calculus. Vector Integral Calculus."}, "IM3080": {"name": "DESIGN & INNOVATION PROJECT", "au": "  2.0", "program": "IEM(EEE)", "mutually_exclusive": "EE3080, IM2079", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "Year 3 Class", "grade_type": null, "description": "Project Proposal, Lectures on Project Management, Project Implementation, Project Report, Oral Presentation,Design and Innovation Competition."}, "MA2002": {"name": "THEORY OF MECHANISM", "au": "  3.0", "program": "ME", "mutually_exclusive": "MP2002", "not_available_to_program": "ACBS, ACC, ADM, ARED, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, ESPP, HIST, IEEC, IEM, LMS, MACS, MAEC, MAEO, MAT, MATH, MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MA1001", "grade_type": null, "description": "The purpose of a mechanism is to transmit motion and force. This course introduces the students some basic mechanisms including linkages, cams and gears. Mechanisms are the building blocks of a machine. In a machine design problem, very often the first task is to determine the type and configurations of mechanisms to provide the desired motions. Once the kinematic issues are addressed, the dynamic analysis can then be performed. In this course, techniques for the kinematic and dynamic analyses of mechanisms will be covered. A course in the theory of mechanisms is essential for any mechanical engineers as the knowledge is fundamental in understanding the working of machines. Apart from analytical ability, it also provides students the opportunities to develop their design capability."}, "MA3004": {"name": "MATHEMATICAL METHODS IN ENGINEERING", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MH1810 & MH1811 OR CY1203 OR MH2812 OR CY1602 OR MH2810", "grade_type": null, "description": "This course covers introductory material on PDEs, FEM and CFD and is arranged in three parts. The first part covers classification of PDEs and typical analytical methods for solving them. The second part covers basic finite element concepts and typical applications in solid mechanics. The third part covers basic concepts in CFD with a focus on finite volume methods.   "}, "MA3006": {"name": "FLUID MECHANICS", "au": "  3.0", "program": "ME", "mutually_exclusive": "MP2005, MP2305", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "MA2003", "grade_type": null, "description": "Momentum equation and its applications. Dimensional analysis and similitude. Internal flows and piping systems. Principles and applications of fluid machines."}, "ET9131": {"name": "VENTURING INTO ENTREPRENEURSHIP", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9101, ET9121, RE8001", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide you with a fundamental understanding of the entrepreneurial process, of how entrepreneurs start and implement their business ideas and to instill in them an entrepreneurial mindset posture for the future. By immersing in activities relevant to entrepreneurship and value creation, you will discover and acquire one's entrepreneurial passion, motivation and mindset. You will be introduced to the concepts of entrepreneurship, innovation and new venture creation process. You, individually and collectively as a team, will learn to generate ideas, identify opportunities and investigate whether an idea can be turned into a viable business through a feasibility analysis."}, "ET9132": {"name": "NEW VENTURE FINANCING", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9102", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to help you to better appreciate the startup formation process, in particular, in securing proper venture financing to ringfence intellectual property intangibles, undertake product developments, talent acquisitions, market expansion and ultimately leading to a viable exit strategy for all stakeholders.  You will be able to understand the entrepreneurship development from a funding/financing viewpoint.  At the same time, You will gain insights on the investment perspectives from both the entrepreneurs and Venture Capital firms with respect to the funding cycles and expectations.  This course will clarify key financial concepts, accounting principles and market practices that will better equip aspiring entrepreneurs to secure funding for their new ventures.This course is suitable for those who are planning and currently involved in startup creation and would like to gain suitable skillsets on how to secure funding from different channels and sources."}, "ET9133": {"name": "MANAGING GROWING ENTERPRISES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9103", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "ET9131 & ET9132", "grade_type": null, "description": "The start-up and growth of an enterprise invariably involves both human and financial capital. To manage the increasing pool of human resources and to convince venture capitalists to invest become two main issues especially for growing ventures. This module consists of two parts: in the first part, organization and human resource management are introduced; in the second part, the focus is on writing a convincing business plan to attract venture capital investment. "}, "ET9134": {"name": "ENTERPRISE STRATEGY", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9104, RE8009", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "ET9131 & ET9132 & ET9133", "grade_type": null, "description": "This course aims to provide students a holistic approach towards the management of a company, from start-up phase to growth & expansion, where you would understand and learn to recognise and analyse an organisation as an integrated entity in achieving the company's objectives and strategies. In deliberating and executing some of the major business decisions that entrepreneurs face when growing their ventures and competing with other companies in the same industry, you will broaden and deepen your analytical skills when assessing the correlational impact across the organisation instead of viewing each functional activity as a standalone.Through the use of a business simulator software platform, you will be immersed in and experience the process of managing a business. You will form groups with your peers to compete with one another. As you work through the organization's life cycle in the simulation, external forces and real-world managerial dilemmas are added to test your responsiveness and abilities to deal with uncertainties."}, "HY4118": {"name": "INDEPENDENT STUDY I", "au": "  4.0", "program": "PHIL(SOH)", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "The course is offered to satisfied special needs of individual students in areas of interest of a faculty member or members. It is usually taught at an advanced level, with intensive reading and writing."}, "HA3021": {"name": "COMPARATIVE POLITICS IN ASIA", "au": "  3.0", "program": "PPGA(SSS)", "mutually_exclusive": "HA1005", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "HA1002 & HA1012", "grade_type": null, "description": "The unit will enable students to analyse different interpretations of political development in Asia; understand the role of the US in shaping Asia into a hegemonic order; grasp the basic features of the Japanese model of the developmental state and its influence in East Asia; understand the key features of China's political reform and its rising economic and strategic influence; to evaluate the fragile political development of Southeast Asian states; understand the fundamental effects of the 1997 financial crisis in Asia; and evaluate the character and prospects of Asian regionalism at economic, political and security levels."}, "HS0301": {"name": "ENVIRONMENTAL SUSTAINABILITY", "au": "  3.0", "program": "SOC(SSS)", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": null, "grade_type": null, "description": "Our planet is undergoing radical environmental and social changes. Environmental sustainability has now been put into question by, for example, our consumption patterns, loss of biodiversity, depletion of resources, and imbalanced power relations. With apparent ecological and social limits to globalization and development, the current levels of consumption are unsustainable, inequitable, and inaccessible to the majority of humans. Understanding the environmental sustainability is a crucial matter at a time when our planet is in peril - both environmentally and socially. This course will show possible pathways for a sustainable earth.  "}, "HS3018": {"name": "SOCIOLOGY OF GENDER", "au": "  3.0", "program": "SOC(SSS)", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "HS1001 & HS2002 & HS2005 OR HS1001 & HS2004 & HS2005 OR HS1001 & HS2001 & HS2002 OR HS1001 & HS2001 & HS2005 OR HS1001 & HS2001 & HS2003 OR HS1001 & HS2001 & HS2004 OR HS1001 & HS2002 & HS2003 OR HS1001 & HS2002 & HS2004 OR HS1001 & HS2003 & HS2005 OR HS1001 & HS2003 & HS2004 OR ST9001(Corequisite) OR HQ8010(Corequisite)", "grade_type": null, "description": "This course examines gender relations within various institutional contexts. Beginning with a discussion of gender difference and inequality from a sociological perspective, we consider theories of gender, including the nature of patriarchy, and the social and cultural construction of women and men. In particular, we will discuss the structural and ideological aspects of gender relations in social contexts such as the following: the family and household, work and the economy, politics and the state, and popular culture and mass media. Within these contexts, we examine specific issues, for example, the domestic division of labour, gender segregation in employment, gender representations and identities, and gender inequality in relation to crime and violence. In so doing, we also analyze the effectiveness of public policy in these areas."}, "HS4080": {"name": "HONOURS SEMINAR IN APPLIED SOCIOLOGY", "au": "  4.0", "program": "SOC(SSS)", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "HS1001 & HS2001 & HS2002 & HS3001 & HS3002 OR HS1001 & HS1004 & HS2001 & HS3001 & HS3002", "grade_type": null, "description": "This course focuses on a particular topic in applied sociology, especially by bringing theoretical insights and empirical research to bear on sociological analysis and evaluation of an area of social policy."}, "SS9101": {"name": "BADMINTON", "au": "  3.0", "program": "SSM", "mutually_exclusive": "SS9111", "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "Physically active.No injuries/medical conditions.", "grade_type": null, "description": "The course aims to provide students with opportunities to acquire the knowledge, understanding and experience necessary to develop an appreciation of, and play, the sport of badminton. Students will be taught the essential skills necessary to play the sport."}, "SS9104": {"name": "BASKETBALL", "au": "  3.0", "program": "SSM", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_program_with": null, "not_available_as_core_to_program": null, "prerequisite": "Physically active.No injuries/medical conditions.", "grade_type": null, "description": "This course is designed to provide students with the basic skills and knowledge to play and enjoy recreational basketball. Students will be taught on basic fundamental skills, rule/terminology, officiating, team offense/defense, and situational strategies."}}