{"BS1005": {"name": "BIOCHEMISTRY I", "au": "  3.0", "program": "BS", "mutually_exclusive": "CBC121", "not_available_to_program": "ACBS, ACC, ADM, AERO, ASEC, BCE, BCG, BEEC, BIE, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, ECMA, ECON, ECPP, ECPS, EEE, EEE(2004-2010)(Non Direct Entry), EEEC, ELAH, ELH, ENE, ENEC, ENG, ENG(EEE)(2004-2010), IEEC, IEM, LMS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SOC, SSM", "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": "EESS, ESPP", "not_available_as_PE_to_program": null, "prerequisite": "For UE, students are encouraged to register index no. 08539", "grade_type": null, "description": "To learn biochemical principles governing the properties and structures of biological macromolecules.Mutually exclusive with: CBC121, CM1051 (AY2014 and earlier)Not availabe to Programme: CHEM (AY2014 and earlier)"}, "BS2001": {"name": "PHYSIOLOGY", "au": "  3.0", "program": "BS", "mutually_exclusive": "BS201", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "CM1051 passed in AY2015 onwards can use to replace BS1001 BS101 OR BS1001 OR CY1001", "grade_type": null, "description": "Lectures will include general introduction on the integration of biological systems, interaction between cells and extracellular environment, neural and endocrine control of homeostasis and forms and function and regulation of physiological systems."}, "BS2012": {"name": "GENETICS & GENOMICS", "au": "  3.0", "program": "BS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "BS1006", "grade_type": null, "description": "\tBasic concepts of genetics from genes to chromosomes\tGenetic variations, inheritance and genetic traits\tHardy-Weinberg Principle: Mendelian to population genetics\tHuman genome - genes and evolution\tLinkage disequilibrium and population genetics\tAssociation and Genome Wide Association Studies (GWAS)\tModel organisms in genetics ? from yeast to C. elegans\tModel organisms in genetics ? from drosophila to mouse\tGene expression regulation: from promoters to epigenetics\tGenome-wide genomics, transcriptomics and systems biology\tCell cycle and development ? genetics of cancer\tGenetics in medicine applications"}, "BS211S": {"name": "EQUATIONS OF LIFE", "au": "  3.0", "program": "BS", "mutually_exclusive": "BS2011", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null}, "Remark:": {"name": "Self-Paced Course", "au": null, "program": null, "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Six biological topics have been selected covering enzyme to ecology. A short description of each equation and the learning outcomes from each topic has been given below. Every topic will be introduced with investigative approach to the point where mathematics comes in to solve the biological problem. The mathematical principles (equations) are rather simple and well within A-level category. On the other hand, these equations have contributed to the fundamental questions of twentieth century biology. Using each of these equations, the students have to solve numerical problems related to cross-talk between biology and mathematics. This is not meant to teach mathematics as in a typical mathematics course because it is a biology course with emphasis on the importance of mathematics."}, "BS3003": {"name": "DEVELOPMENTAL BIOLOGY", "au": "  3.0", "program": "BS", "mutually_exclusive": "BS306", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "BS203 & BS821 OR BS2004", "grade_type": null, "description": "To give an introductory course into the early embryonic development of different model organisms. To give an insight into animals which are used in biological research and from which important contributions to understanding fundamental processes in cells have been made. Completion of this course should give participants a good understanding of developmental biology and provide a basis for more advanced courses. This course gives an understanding of how development occurs and is regulated in embryos of several species of animals, primarily those with well-characterized genetics and to become familiar with the experimental strategies and tools used by developmental biologists.The lectures will cover investigations of developmental processes using well-studied  model organisms such as mice, zebra fish, xenopus, drosophila and nematodes as examples."}, "BU8101": {"name": "ACCOUNTING: A USER PERSPECTIVE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1101, AC1101, AD1101, AD2101, EE0062, EE8062", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS(ITG), MS(NULL), MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.Students will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.Topics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization."}, "BU8201": {"name": "BUSINESS FINANCE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB102, AB1201, MB102", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is an introductory course in finance for non-business and non-accounting students, which provides students with a broad understanding of the principles and practice of Business Finance/Financial Management.   The emphasis is on the major financial decisions made by companies and the valuation of investments made by them.  The course starts by examining the various forms of businesses and the importance of interest rates.  Time value of money, and the linkage between risk and return, lays the foundation for evaluating the price of bonds and stocks.  Students will learn and apply principles of capital budgeting (calculating the profitability of various projects and deciding which one to proceed) and capital structure (financing approved projects by issuing shares or bonds, or using retained earnings).  The decision to use extra cash to pay dividends or repurchase shares will be analysed and the course concludes with the use of derivatives to protect and enhance the value of firms.Students intending to take this course should be numerate (good and comfortable with mathematical calculations and formulas) e.g. they should know well compound interest calculations, Sum of Geometric Progression (G.P.) calculation before attending this course.  "}, "BU8301": {"name": "FUNDAMENTALS OF BUSINESS LAW", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB107, AB1301, MB107", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS(ITG), MS(NULL), MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The aim of this course is to provide a good understanding of the main principles of law affecting business. As an introductory course, it will cover the key principles and issues. The course will start with an introduction of the basic concepts and definitions relating to the law and the legal system in Singapore before focusing on several important areas of law: contract law, agency law, the law in relation to business organizations in Singapore and the law of tort."}, "BU8501": {"name": "MARKETING FOR THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB112, AB1501, MB103", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course is designed for students who have chosen to specialise in disciplines other than business. As students may already know, a working knowledge of marketing is rather useful wherever their career takes them. We will discuss the basic principles of marketing. However, the focus is on its practice and how this understanding could potentially enhance the students? future performance in their chosen field. A hands-on approach is expected of students and activities have been incorporated to encourage observation and enhance analytical ability. The course will require you to analyse businesses, lead discussions and present your analysis and recommendations on selected organisations."}, "CE8002": {"name": "GETTING WHAT YOU WANT WITH NEGOTIATION", "au": "  3.0", "program": "CE", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Approaches, styles & outcomes, Interpersonal communication, Argumentation. The Negotiation Process: Planning and preparing, defining issues, objectives, desired outcomes, Using psychology, tactics and strategies, strengthening case, working toward agreement, making proposals, looking for common ground, feedback/countermoves, helping other party move. Dealing with the difficulties: what can go wrong, handling conflict, deadlock. Working towards closure. Issues of gender, culture, perception, emotion. Use of power. Electronic negotiation."}, "EE1002": {"name": "PHYSICS FOUNDATION FOR ELECTRICAL & ELECTRONIC ENGINEERING", "au": "  4.0", "program": "EEE", "mutually_exclusive": "CY1306, EE2091, FE1002, PH1105, PH1106, PH116S", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "FE1011 OR FE1012 OR FE0001 OR PH1011 OR PH1012", "grade_type": null, "description": "Introduction of electromagnetic fields and applications. Electromagnetic in electronics, circuits and communications. Introduction to light, lasers and optical spectroscopy. Principles of geometric and wave optical components. Introduction to quantum physics and applications. Applications of quantum physics in electronics and lasers."}, "EE2010": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2004", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "FE1006 & FE1007 OR MATH1A & MATH1B OR EE2092 OR MH1810 & MH1811 OR FE1006 & MH1811 OR FE1007 & MH1810 OR MH2810 OR CY1601 & CY1602", "grade_type": null, "description": "Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "EE3002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "E314, IM2002, M473, MP3006", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": "CE, CSC", "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "MH1812": {"name": "DISCRETE MATHEMATICS", "au": "  3.0", "program": "MATH(SPS)", "mutually_exclusive": "CE1001, CZ1001", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Elementary Number Theory; Propositional Logic; Sets; Predicate Logic; Linear Recurrence Relation; Relations and Functions; Graphs; Complex Numbers; Vectors and Matrices; Elementary Combinatorics."}, "MA2004": {"name": "MANUFACTURING PROCESSES", "au": "  3.0", "program": "ME", "mutually_exclusive": "AE2011, MP2004, MP2304, MP3104, MP3304", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction and overview of manufacturing. Dimensions and surfaces measurement. Casting. Shaping processes for polymers. Sheet metalworking. Materials removal processes. Joining processes. Microelectronics manufacturing."}, "ET9131": {"name": "ENTREPRENEURSHIP &  MARKETING FOR NEW VENTURES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9101, ET9121, RE8001", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is the module that introduces students to the concepts of entrepreneurship. The goal of this course is to provide students with essential information on the entrepreneurial process. The focuses of the course are on business concept development and feasibility analysis to assess the viability of the concept. The course includes concepts of entrepreneurship, creativity, innovation, and new venture creation process. Students will learn to generate ideas, identify opportunities and investigate whether it can be turned into a viable business through feasibility analysis.  Entrepreneurial marketing will be given emphasis in this module as it is one of the important factors in feasibility analysis. Concepts such as product positioning, market segmentation, Michael Potter?s five forces of industry structure and SWOT (Strength, weakness, Opportunity and Threat) will be introduced. Students will also learn to select, develop, and evaluate new products / services, set prices to maximize profitability and make the most efficient use of public relations, publicity during product launches and initial rollouts. "}, "ET9132": {"name": "ENTREPRENEURIAL ACCOUNTING & FINANCE", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9102", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Entrepreneurs need money to start and to grow their business. It is important for entrepreneurs to understand how revenue is generated, how to source for funds, how to control cash flow, how to assess the success of the company in monetary terms, and how to value a company for various purposes. These and other issues are covered in this module. For the foundation, the basic accounting concepts will be introduced, followed by financial concepts and tools relevant to entrepreneurs. "}, "ET9133": {"name": "MANAGING GROWING ENTERPRISES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9103", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The start-up and growth of an enterprise invariably involves both human and financial capital. To manage the increasing pool of human resources and to convince venture capitalists to invest become two main issues especially for growing ventures. This module consists of two parts: in the first part, organization and human resource management are introduced; in the second part, the focus is on writing a convincing business plan to attract venture capital investment. "}, "ET9134": {"name": "ENTERPRISE STRATEGY", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9104, RE8009", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is an immersive experiential learning module. An online business simulator is used as a platform to let students experience the process of managing a business through the virtual media. Students are exposed to some of the major business decisions that entrepreneurs face when growing their ventures and competing with other companies in the same industry. Students are grouped into teams and the teams will compete with one another. As students work through the organization's life cycle in the simulation, external forces and managerial dilemmas are added.  Students will apply the various tools, case-studies and theories from previous modules as the new venture expands its operations and subsequently tackle new tasks, take on additional responsibilities and make difficult decisions."}}