{"AB0602": {"name": "COMMUNICATION MANAGEMENT STRATEGIES", "au": "  4.0", "program": "ACC", "mutually_exclusive": "AB214", "not_available_to_program": "ACBS(GA) 1, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACBS(GB) 4, ACC(GA) 1, ACC(GA) 2, ACC(GA) 3, ACC(GB) 1, ACC(GB) 3, BCE 1, BCE 2, BCE 4, BCG 1, BCG 2, BCG 4, BUS 1, BUS 3, BUS(GA) 1, BUS(GB) 1, BUS(HRC) 2, BUS(MKG) 2, BUS(RMI) 2, BUS(THM) 2", "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "AB114 OR AB0601", "grade_type": null, "description": "The purpose of this course is to prepare students for the communications challenges that are likely to be met in rapidly evolving global business environments. Its primary objective is to enable students to present themselves professionally not only in the way they speak and write, but also as confident participants in their chosen profession."}, "BM2506": {"name": "DIGITAL MARKETING:CONNECTING WITH CUSTOMERS IN TODAY'S WORLD", "au": "  4.0", "program": "BUS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course addresses marketing through digital media in the following aspects:1.\tFundamentals of digital marketing2.\tDigital marketing strategies and management 3.\tSocial media marketing4.\tIssues in implementing a digital marketing initiative"}, "BU8101": {"name": "ACCOUNTING: A USER PERSPECTIVE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1101, AC1101, AD1101, AD2101, EE0062, EE8062", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS(ITG), MS(NULL), MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.Students will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.Topics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization."}, "BU8201": {"name": "BUSINESS FINANCE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB102, AB1201, MB102", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is an introductory course in finance for non-business and non-accounting students, which provides students with a broad understanding of the principles and practice of Business Finance/Financial Management.   The emphasis is on the major financial decisions made by companies and the valuation of investments made by them.  The course starts by examining the various forms of businesses and the importance of interest rates.  Time value of money, and the linkage between risk and return, lays the foundation for evaluating the price of bonds and stocks.  Students will learn and apply principles of capital budgeting (calculating the profitability of various projects and deciding which one to proceed) and capital structure (financing approved projects by issuing shares or bonds, or using retained earnings).  The decision to use extra cash to pay dividends or repurchase shares will be analysed and the course concludes with the use of derivatives to protect and enhance the value of firms.Students intending to take this course should be numerate (good and comfortable with mathematical calculations and formulas) e.g. they should know well compound interest calculations, Sum of Geometric Progression (G.P.) calculation before attending this course.  "}, "BU8301": {"name": "FUNDAMENTALS OF BUSINESS LAW", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB107, AB1301, MB107", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS(ITG), MS(NULL), MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The aim of this course is to provide a good understanding of the main principles of law affecting business. As an introductory course, it will cover the key principles and issues. The course will start with an introduction of the basic concepts and definitions relating to the law and the legal system in Singapore before focusing on several important areas of law: contract law, agency law, the law in relation to business organizations in Singapore and the law of tort."}, "BU8501": {"name": "MARKETING FOR THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB112, AB1501, MB103", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course is designed for students who have chosen to specialise in disciplines other than business. As students may already know, a working knowledge of marketing is rather useful wherever their career takes them. We will discuss the basic principles of marketing. However, the focus is on its practice and how this understanding could potentially enhance the students? future performance in their chosen field. A hands-on approach is expected of students and activities have been incorporated to encourage observation and enhance analytical ability. The course will require you to analyse businesses, lead discussions and present your analysis and recommendations on selected organisations."}, "BU8542": {"name": "SOCIAL MARKETING - MAKING THE WORLD A BETTER PLACE", "au": "  3.0", "program": "BUS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "LA-Yr1 intake from AY14/D.entry fromAY15;LS for others", "grade_type": null, "description": "Social marketing is the use of business marketing concepts and techniques to change behaviour for the betterment of society. The course is designed for students concerned about social issues and passionate about making a difference.  It exposes students to a myriad of social problems plaguing society and acquaints them with marketing concepts, tools and strategies to effect change. Students will work in teams to develop a social marketing campaign to address a social problem."}, "BU8601": {"name": "FUNDAMENTALS OF MANAGEMENT", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB105, AB1601, BE2601, MB106", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS, MATH(BA), MS(ITG), MS(NULL), MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "To function in an organisation, technical skills by themselves are insufficient; they have to be supplemented by management training.  Success in an organisation depends as much on general management skills and understanding operational systems as on technical expertise.  Hence, students need a firm foundation in management skills.  This course is designed for non-business students and aims to equip them with the knowledge, skills and competence in various aspects of management, including: the role of management and managers; decision-making, planning and strategy; managing organisational architecture; managing individuals and groups; and controlling critical organisational processes."}, "BU8641": {"name": "CULTURAL INTELLIGENCE: HOW TO BE AN EXPLORER OF THE WORLD", "au": "  3.0", "program": "BUS", "mutually_exclusive": "BH331, BH3603", "not_available_to_program": "ACBS, ACC, BUS, MS-2ndMaj/Spec(MSB)", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "LA-Yr1 intake from AY14/D.entry fromAY15;LS for others", "grade_type": null, "description": "We live in a global world, where a premium is placed on the ability to navigate and adapt to differences. Cultural intelligence, CQ is the capability to function effectively across national, ethnic and organizational, organizational cultures (Ang & Van Dyne). IQ and EQ are no longer enough, CQ is becoming a critical predictor for success in the borderless world of the 21st century. The good news is that CQ can be developed and learnt by almost anyone. This course will focus on providing students a conceptual framework for CQ, as well as a set of tools to navigate and explore the world.At the end of the course, students can expect the following outcomes:-(1)\tA greater understanding of their own motivation, culture, values, and personality, as well         as their CQ strengths and weaknesses (CQ Motivation & Strategy) (2)\tKnowledge and experience of how cultures differ in values and behaviours, and how to         capitalize on similarities, and leverage on the differences (CQ Knowledge); (3)\tEnhanced awareness and efficacy of your own communication style in cross cultural         contexts (CQ Behaviour)Teaching Method: Highly experiential and focused on learning from own self-reflection, class activities and group work, this course focuses on bringing conceptual knowledge to life. "}, "BU8642": {"name": "LEADERSHIP IN THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB9602, BH333", "not_available_to_program": "ACBS, ACC, BCE, BCG, BUS", "not_available_to_all_program_with": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "LA-Yr1 intake from AY14/D.entry fromAY15;LS for others", "grade_type": null, "description": "Leadership is a hot topic in corporations, government agencies, and non-profit organizations. But what do leaders really do in the world of work? What do YOU need to do in order to be a really effective leader? This course is for students who hope to become managers, leaders or consultants in workplaces anywhere in the world.The course covers some important non-textbook principles for organizational leadership, with an emphasis on both and \"eastern\" and \"western\" approaches to leadership. You will learn practical skills and techniques for networking, teamworking, managing and leading people at work (eg., setting goals, delegating work, conducting a staff meeting, coaching employees, impressing various stakeholders). The assessment will actually be fun and will provide further learning for you! It involves a real world project, some independent research into leadership concepts, and self-reflection on your own leadership style. Weekly seminars will involve lots of discussions, roleplays, and group activities, so be prepared to experience many aspects of leadership for real!"}, "CH9301": {"name": "EMERGING TECHNOLOGIES IN ENERGY CONVERSION & STORAGE", "au": "  3.0", "program": "CBE", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Reactions and principles of chemical equilibria involved in gas-to-liquid conversion, clean coal technologies, and carbon capture and storageFirst, second and third generation solar cells, p-n junction, liquid junction solar cellsGibbs free energy, hydrogen fuel cells, direct methanol fuel cells, solid oxide fuel cells Rechargeable and non-rechargeable batteries, Li-ion batteriesSymmetrical and non-symmetrical supercapacitors, electrical double layerHydrogen storage, metal hydrides, carbon-based storage materials"}, "CF9001": {"name": "CHINESE LANGUAGE & CULTURE STUDIES", "au": "  6.0", "program": "CI", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "No prior knowledge of the Chinese language", "grade_type": null, "description": "The language part of the course is suitable for non-native speakers who wishes to gain an insight into the Chinese Language. The course contents are designed to help you build Chinese vocabulary and basic conversational skills for daily usage.The Chinese cultural studies course aims to expose you to the intriguing aspects of Chineseculture through classroom sessions, hands-on learning and visits to places of interest with Chinese cultural significance.Course content1. Chinese Language2.\tCultural Studies:a. The Chinese Communities in Southeast Asia; b.Chinese Ink Painting: The Aesthetic Perspective3. Introduction of the Chinese Paper Cutting and the Chinese Culture4. Introduction of the Chinese Seal Engraving5. Introduction of the Traditional Chinese Medicine (TCM)"}, "SP0073": {"name": "THE GREAT IDEAS", "au": "  3.0", "program": "CS", "mutually_exclusive": "SP0003", "not_available_to_program": null, "not_available_to_all_program_with": "(Admyr 2004-2013)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "Only for University Scholars Programme (USP) students.", "grade_type": null, "description": "This course examines ongoing debates about the great ideas of liberty, equality, and rights. We explore different nations' contrasting approaches to the law of freedom of expression, freedom of religion, rights to privacy, rights to due process and humane treatment, rights to equality for women and minorities, and rights to personal autonomy in matters such as sexuality. Through interactive seminars and short writing assignments, we examine the changing meaning of liberty in different nations, and we gain practice articulating our own perspectives on these issues. We examine contemporary cases facing courts and legislatures and how cases have drawn on England's Magna Carta (1215), the United States Constitution's Bill of Rights (1789), the United Nations' Universal Declaration of Human Rights (1948), and the Singapore Constitution's (1965) guarantee of \"Fundamental Liberties\" for all. Special attention is focused on rationales for Singapore's approach, sometimes referred to as \"Singapore communitarianism,\" \"authoritarian constitutionalism,\" or \"illiberal democracy.\""}, "EE1002": {"name": "PHYSICS FOUNDATION FOR ELECTRICAL & ELECTRONIC ENGINEERING", "au": "  4.0", "program": "EEE", "mutually_exclusive": "CY1306, EE2091, FE1002, PH1105, PH1106, PH116S", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "FE1011 OR FE1012 OR FE0001 OR PH1011 OR PH1012", "grade_type": null, "description": "Introduction of electromagnetic fields and applications. Electromagnetic in electronics, circuits and communications. Introduction to light, lasers and optical spectroscopy. Principles of geometric and wave optical components. Introduction to quantum physics and applications. Applications of quantum physics in electronics and lasers."}, "EE2010": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2004", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "FE1006 & FE1007 OR MATH1A & MATH1B OR EE2092 OR MH1810 & MH1811 OR FE1006 & MH1811 OR FE1007 & MH1810 OR MH2810 OR CY1601 & CY1602", "grade_type": null, "description": "Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "EE3002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "E314, IM2002, M473, MP3006", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": "CE, CSC", "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "EE4903": {"name": "PHYSIOLOGICAL SYSTEMS ANALYSIS", "au": "  3.0", "program": "EEE", "mutually_exclusive": "E434N", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "System Modelling, Control and Analysis. The Respiratory System. The Cardiovascular System. The Neuromuscular System. The Renal System."}, "EE8084": {"name": "CYBER SECURITY", "au": "  3.0", "program": "EEE", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "LEARNING OBJECTIVE - The objective of this course is to provide students with basic appreciation and understanding of the underlying security issues and implications of the use of various networked systems and electronic devices in the modern cyber-society from both user and management perspectives. Topics to be covered include overview of information systems and devices in a global network environment, threats to information systems and devices, security models, and concepts for secrecy, integrity and availability. Other topics of security concerns will also be explored: evaluations of secure information systems, security requirements analysis, security management policies, security trends and emerging technologies. CONTENT - Introduction to Cyber Crimes and Security Issues in a Cyber-environment. Digital Liability Management. Security Planning and Management. Security Solutions and Technologies. Web Security and Electronic Payment Models. Security Applications and Cases."}, "MA2004": {"name": "MANUFACTURING PROCESSES", "au": "  3.0", "program": "ME", "mutually_exclusive": "AE2011, MP2004, MP2304, MP3104, MP3304", "not_available_to_program": null, "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Introduction and overview of manufacturing. Dimensions and surfaces measurement. Casting. Shaping processes for polymers. Sheet metalworking. Materials removal processes. Joining processes. Microelectronics manufacturing."}, "MA2071": {"name": "LABORATORY EXPERIMENTS (ME)", "au": "  1.0", "program": "ME", "mutually_exclusive": "AE2071, AE2072, MA2072, MP2071, MP2072", "not_available_to_program": "AERO, ASEC", "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The 10 experiments consist of:E2.1\tEffects of cutting parameters on surface roughness of turned parts  E2.2 \tStudy of fan performance using dimensional analysisE2.3 \tEnergy balance in a compressorE2.4 \tDimensional measurement of componentsE2.5 \tTwo-dimensional strain measurementE2.6 \tFrictional losses in pipes and fittings E2.7 \tRefrigeration cycle experiment E2.8 \tNon-destructive testing E2.9 \tBalancing of rotating masses E2.10\tTorsion of cylindrical shaftsFor the 10 experiments, each student will submit nine log-sheets (on the same day) and one Technical Report (within 1 week)."}, "MA3071": {"name": "ENGINEERING EXPERIMENTS (ME)", "au": "  1.0", "program": "ME", "mutually_exclusive": "MA3072, MP3071, MP3072, MP3073", "not_available_to_program": "AERO, ASEC", "not_available_to_all_program_with": "", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Code\tTitleP3.1\tUnsymmetric BendingP3.2\tBehaviour of Composite BeamP3.3\tStiffness and strength of Irregular-shaped BeamP3.4\tUltimate Load.Of A Beam Under Bending P3.5\tMachine Vibration analysis and Fault RecognitionP3.6\tVibration Testing.Of Multiple..DOF SystemsP3.7\tControl Of VibrationP3.8\tVibration Of A 4 Cylinder EngineP3.9\tCAD/CAM and CNCP3.10\tPlastic Injection MouldingP3.11\tThermo-formingP3.12\tDesign for manufacture and assemblyP3.13\tPerformance evaluation of milling operationsP3.14\tEvaluation of surface finish produced by various methodsP3.15\tProduct disassemblyP3.16\tDesign and construction of an analogue PID controllerP3.17\tReal Time Control & AI Prog of robot beetleP3.18\tMotion control of a ball screw systemP3.19\tA study of servo-hydraulic systemP3.20\tLiquid level controlP3.21\tStudy of industrial motor characteristicsP3.22\tCombined heat transfer by free convection and radiationP3.23\tGas TurbineP3.24\tFlow over an aerofoil sectionP3.25\tCompressible flowP3.26\tFan Characteristics for differP3.27\tThermal radiation unitP3.28\tForced convection in tubesP3.29\tConvective Heat TransferP3.30\tFilm and dropwise condensationE3.1\tDynamic Vibration AbsorberE3.2\tVibration of a 2-DOF SystemE3.3\tComputer Modelling, Simulation and Control of an Electromechanical SystemE3.4\tControl Of A Dc ServomotorE3.5\tHeat ExchangerE3.6\tTransient Heat Conduction"}, "MA9001": {"name": "INTRODUCTION TO ENERGY", "au": "  3.0", "program": "ME", "mutually_exclusive": "MP0210", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "For summerNTU students", "grade_type": null, "description": "Overview of energy scenario with respect to demand, availability, environmental concerns, and followed by description of the electricity system. Then each energy source is introduced briefly, covering both conventional and renewable sources. The challenges in energy storage and conversion are discussed. Lastly, efficient energy utilization and energy conservation are discussed."}, "MA9030": {"name": "BIOPRINTING: PRINCIPLES & APPLICATIONS", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "For summerNTU students", "grade_type": null, "description": "The course starts with introduction to tissue engineering and scaffolds for tissue engineering. Various bioprinting processes will be explained and the materials for bioprinting will be introduced. The students will also learn about cell sources and 3D cell culture techniques. Other topics include computational design and simulation in bioprinting. The students will attend a workshop on bioprinting to be exposed to the operation of a bioprinter. There will be also a group discussion session for the students to critically analyze the research field of bioprinting from their point of view. "}, "MA9031": {"name": "3D PRINTING & ADDITIVE MANUFACTURING:PRINCIPLES&APPLICATIONS", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "For summerNTU students", "grade_type": null, "description": "This course aims to provide a general understanding of Additive Manufacturing or 3D Printing as it is more commonly known.  It starts with an introduction and the importance of 3D Printing and describes the process chain.The course will equip the students with all the 3D printing systems and technologies, their pros and cons.  It will also cover the file format used in 3D printers. More importantly, a  comprehensive range of applications and case studies will be covered. Finally, benchmarking, growth and trends will be described."}, "MA9032": {"name": "STANDARDS AND LASER IN 3D PRINTING", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "For summerNTU students", "grade_type": null, "description": "This course aims to provide a general understanding of standards and measurement sciences in 3D Printing. Standards and measurement sciences are necessary knowledge to ensure successful implementation of 3D printing in any company.In the same course, we also introduce laser technologies used in 3D printing as laser-based techniques are instrumental in creating functional components directly.  The course will equip the students with the fundamental knowledge needed to implement 3D printing as a manufacturing technique for functional engineering applications.  "}, "AAA18E": {"name": "DRAWING", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AAA184", "not_available_to_program": "ARED, SCED", "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "Req to purchase materials (tools, brushes, paper, etc)", "grade_type": null, "description": "Investigates the nature of drawing, from traditional art practice to the range of meanings drawing has in contemporary art.Attendance is a vital part in which there is continuous assessments."}, "AAA18J": {"name": "PAINTING WITH WATERCOLOUR", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AAA186", "not_available_to_program": "ARED, SCED", "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to highlight the beauty and ephemeral qualities of watercolour painting. Students will be progressively taught various techniques to achieve different results. There will be an emphasis on hands-on practice as well as keynotes on how to appreciate the visual qualities of watercolour paintings. Students will first be taught basic drawing and paintings skills, after which students are encouraged to take a more experimental and gestural approach to watercolour painting.Attendance is a vital part in which there is continuous assessments."}, "AAA18K": {"name": "COMMUNICATION DESIGN", "au": "  3.0", "program": "NIE", "mutually_exclusive": "AAA187", "not_available_to_program": "ARED, SCED", "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "Req to purchase materials (tools, brushes, paper, etc)", "grade_type": null, "description": "This course introduces the study of communication design. 1.\tTechnical skills related to the conceptualization and visual articulation of signs, images, symbols and composition.2.\tUnderstanding of the elements of art and principles of design3.\tCurrent and historical references to graphic design practice will be made.Attendance is a requirement."}, "AAA28D": {"name": "ARTS ACROSS THE BORDERS", "au": "  3.0", "program": "NIE", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "A study focused on the discovery and understanding of the artistic heritage, psychogeography and socio-cultural significances of a specific part of Singapore.  \"Borders\" in this sense may comprise the historic, contemporary, architectural, cultural, social, political, psychic and imaginary boundaries that define every day life in the area. A considerable part of the course will be spent doing experiential work (maps, photography, video itself). Course work will involve comprising Situationist-inspired interventions that take as starting point the ways that this particular quarter and its inhabitants perform."}, "AAR23C": {"name": "FILM STUDIES", "au": "  3.0", "program": "NIE", "mutually_exclusive": "HL3001", "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide an introduction to film appreciation and analysis. As this course is offered by the English Language and Literature Academic Group, the focus of the course is on film as a construct of art and narrative, paying particular attention to aspects of film form, aesthetics and style. Due to the constraints of time, we will study primarily contemporary feature films from the year 2000.The course is divided into two parts. Part One introduces the four elements of film namely mise-en-scene, cinematography, editing and sound that provide the basic vocabulary of film studies. Part Two studies filmic texts as visual forms of story-telling and explores the issues of representation and spectatorship."}, "ET0001": {"name": "ENTERPRISE & INNOVATION", "au": "  1.0", "program": "NTC", "mutually_exclusive": null, "not_available_to_program": "BEEC 3, BEEC 4, BIE 3, BIE 4, BMS 4, CBE 3, CBE 4, CBEC 3, CBEC 4, CEE 3, CEE 4, CHEM 4, CHIN 4, CS 4, CVEC 3, CVEC 4, ECON 4, EEE 3, EEE 4, EEEC 3, EEEC 4, EESS 4, ELH 4, ENE 3, ENE 4, ENEC 3, ENEC 4, ENG, HIST 4, IEEC 3, IEEC 4, IEM 3, IEM 4, LMS 4, MAEC 4, MAT 3, MAT 4, MATH 4, MTEC 3, MTEC 4, PHIL 4, PHY 4, PPGA 4, PSY 4, REP 3, REP 4, SOC 4", "not_available_to_all_program_with": " Yr1,  Yr2, (Admyr 2004-2013)-Non Direct Entry, (Admyr 2004-2014)-Direct Entry", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": "Pass/Fail", "description": "The course will be delivered online, which will include lectures, survey assessment, real-life examples, supplementary materials, and recommended readings. It aims to provide students with a basic appreciation of the key concepts of enterprise and innovation. The course content will empower students to gain practical insights on the relevance of enterprise and innovation in their lives by introducing them to the enterprise and innovation ecosystem of the University, the Singapore society, and beyond."}, "ET9131": {"name": "ENTREPRENEURSHIP &  MARKETING FOR NEW VENTURES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9101, ET9121, RE8001", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is the module that introduces students to the concepts of entrepreneurship. The goal of this course is to provide students with essential information on the entrepreneurial process. The focuses of the course are on business concept development and feasibility analysis to assess the viability of the concept. The course includes concepts of entrepreneurship, creativity, innovation, and new venture creation process. Students will learn to generate ideas, identify opportunities and investigate whether it can be turned into a viable business through feasibility analysis.  Entrepreneurial marketing will be given emphasis in this module as it is one of the important factors in feasibility analysis. Concepts such as product positioning, market segmentation, Michael Potter?s five forces of industry structure and SWOT (Strength, weakness, Opportunity and Threat) will be introduced. Students will also learn to select, develop, and evaluate new products / services, set prices to maximize profitability and make the most efficient use of public relations, publicity during product launches and initial rollouts. "}, "ET9132": {"name": "ENTREPRENEURIAL ACCOUNTING & FINANCE", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9102", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "Entrepreneurs need money to start and to grow their business. It is important for entrepreneurs to understand how revenue is generated, how to source for funds, how to control cash flow, how to assess the success of the company in monetary terms, and how to value a company for various purposes. These and other issues are covered in this module. For the foundation, the basic accounting concepts will be introduced, followed by financial concepts and tools relevant to entrepreneurs. "}, "ET9133": {"name": "MANAGING GROWING ENTERPRISES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9103", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "The start-up and growth of an enterprise invariably involves both human and financial capital. To manage the increasing pool of human resources and to convince venture capitalists to invest become two main issues especially for growing ventures. This module consists of two parts: in the first part, organization and human resource management are introduced; in the second part, the focus is on writing a convincing business plan to attract venture capital investment. "}, "ET9134": {"name": "ENTERPRISE STRATEGY", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9104, RE8009", "not_available_to_program": null, "not_available_to_all_program_with": " Yr4", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": null, "grade_type": null, "description": "This is an immersive experiential learning module. An online business simulator is used as a platform to let students experience the process of managing a business through the virtual media. Students are exposed to some of the major business decisions that entrepreneurs face when growing their ventures and competing with other companies in the same industry. Students are grouped into teams and the teams will compete with one another. As students work through the organization's life cycle in the simulation, external forces and managerial dilemmas are added.  Students will apply the various tools, case-studies and theories from previous modules as the new venture expands its operations and subsequently tackle new tasks, take on additional responsibilities and make difficult decisions."}, "HA2017": {"name": "FOREIGN POLICY ANALYSIS", "au": "  3.0", "program": "PPGA(SSS)", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "HA2004", "grade_type": null, "description": "The course is divided in two parts. The first part provides and historical background and overview of foreign policy analysis theoretical perspectives (realism, liberalism and constructivism) and how it relates to International Relations. The second part focuses on the various factors and components that influence and shape decision making in foreign policy, namely actors, structures, media and public opinion, various models, implementation strategies and instruments, economic statecraft, national security and transnational issues considerations. Each unit will include analysis and practical exercises of concrete foreign policy case studies."}, "HS3016": {"name": "SOCIETIES IN COMPARATIVE PERSPECTIVE", "au": "  3.0", "program": "SOC(SSS)", "mutually_exclusive": "HS316", "not_available_to_program": null, "not_available_to_all_program_with": "(Admyr 2004-2010)", "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "HS101 & HS201 & HS202 OR HS101 & HS201 & HS203 OR HS101 & HS201 & HS204 OR HS101 & HS201 & HS205 OR HS101 & HS202 & HS203 OR HS101 & HS202 & HS204 OR HS101 & HS202 & HS205 OR HS101 & HS203 & HS204 OR HS101 & HS203 & HS205 OR HS101 & HS204 & HS205 OR HS1001 & HS2004 & HS2005 OR HS1001 & HS2001 & HS2002 OR HS1001 & HS2001 & HS2005 OR HS1001 & HS2002 & HS2005 OR HS1001 & HS2001 & HS2003 OR HS1001 & HS2001 & HS2004 OR HS1001 & HS2002 & HS2003 OR HS1001 & HS2003 & HS2004 OR HS1001 & HS2002 & HS2004 OR HS1001 & HS2003 & HS2005", "grade_type": null, "description": "This course has four main components: (1) A comparative discussion of the nature of human sociality. (2) Macrosociology: the various types of society that have existed in the past and present, with special attention to peasants (who comprise more than half of the world's people). (3) Kinship and marriage: how to study them both formally and in relation to wider cultural and societal issues. (4) Notions of the person and the self as culturally expressed in different social circumstances. Special attention will be given to social organization in India, China, the Malay world, Southeast Asia, and Europe."}, "SP0083": {"name": "SCIENCE, CULTURE, & SOCIETY", "au": "  3.0", "program": "SSS", "mutually_exclusive": null, "not_available_to_program": null, "not_available_to_all_program_with": null, "not_available_as_core_to_program": null, "not_available_as_UE_to_program": null, "not_available_as_PE_to_program": null, "prerequisite": "Only for University Scholars Programme (USP) students.", "grade_type": null, "description": "This course will investigate the various Socio-political-literary  implications of 20th C. advances in science (and advances in theories of science). Students will explore how scientific innovations in the 20th C. have led to corresponding innovations in contemporary  culture (including literature, film, and the arts).  The evolution of Postmodern culture will be understood in the context of changing attitudes about the means and ends of science."}}