{"AB3601": {"name": "STRATEGIC MANAGEMENT", "au": "  4.0", "program": "ACC", "mutually_exclusive": null, "not_available": "ACBS(GA) 1, ACBS(GA) 2, ACBS(GA) 3, ACBS(GA) 4, ACBS(GB) 1, ACBS(GB) 2, ACBS(GB) 3, ACC(GA) 1, ACC(GA) 2, ACC(GB) 1, ACC(GB) 2, ACC(GB) 3, BCE 1, BCE 2, BCE 3, BCG 1, BCG 2, BCG 3, BUS 1, BUS 2, BUS(AWM) 3, BUS(HRC) 3, BUS(MKG) 3", "prerequisite": "AB1501 & AB1601", "grade_type": null, "description": "The Strategic Management Course focuses on identifying and understanding the sources of superior firm performance. This course introduces theoretical concepts and frameworks useful for analyzing the external and internal environment of the firm, and guiding the formulation and execution of different types of strategies. Strategic issues are examined from the perspective of a chief executive or general manager, focusing on how one can formulate effective strategies and develop the necessary resources and capabilities to achieve sustainable competitive advantage in a global and volatile competitive environment."}, "BS211S": {"name": "EQUATIONS OF LIFE", "au": "  3.0", "program": "BS", "mutually_exclusive": "BS2011", "not_available": null, "prerequisite": null, "grade_type": null}, "Remark:": {"name": "Self-Paced Course", "au": null, "program": null, "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide you with the general knowledge and basic training of mathematics in biology. In this course, you will go back to the early days of biological research to recognize that some great discoveries in biology were possible only through application of mathematics. Additionally, you will study a few biological phenomena that most of you are familiar with, such as Mendelian genetics, population genetics, gene mapping, bacterial mutation, and enzyme catalysis. During the online course, you will learn how to 'translate' a biological problem into 'mathematical language' called an equation. Then you solve the equation by using mathematical tools and arrive at a 'solution' which is one of the equations of life. Finally, you will apply the equation to life situation to test whether the equation has been able to unravel the mystery that you were concerned with at the beginning."}, "BS3008": {"name": "COMPUTATIONAL BIOLOGY & MODELING", "au": "  3.0", "program": "BS", "mutually_exclusive": null, "not_available": "ACBS, ACC, ADM, AERO, ARED, ASEC, BCG, BEEC, BIE, BSB, BUS, CBE, CBEC, CE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEEC, ELAH, ELH, ENE, ENEC, ENG, ENG(CEE), ENG(EEE), ENG(ENE), ENG(ME), ESPP, HIST, IEEC, IEM, LMS, MACS, MAEC, MAEO, MAT, MATH, MEEC, MEEC(DES), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHSC, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "prerequisite": null, "grade_type": null}, "Not available as UE to Programme: ": {"name": "CE, CSC", "au": null, "program": null, "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "BS3012": {"name": "FUNCTIONAL GENOMICS & PROTEOMICS", "au": "  3.0", "program": "BS", "mutually_exclusive": null, "not_available": "ACBS, ACC, ADM, AERO, ARED, ASEC, BCE, BCG, BEEC, BIE, BSPY 1, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, ESPP, HIST, LMS, MACS, MAEC, MAEO, MAT, MATH, ME(DES), ME(NULL), ME(RMS), MEEC(DES), MEEC(NULL), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "prerequisite": "BS1001 & BS1006 & BS1007 & BS2012", "grade_type": null}, "BS3013": {"name": "DRUG DISCOVERY & DEVELOPMENT BIOTECHNOLOGY", "au": "  3.0", "program": "BS", "mutually_exclusive": null, "not_available": "ACBS, ACC, ADM, AERO, ARED, ASEC, BCG, BEEC, BIE, BUS, CBE, CBEC, CE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEEC, ELAH, ELH, ENE, ENEC, ENG, ENG(CEE), ENG(EEE), ENG(ENE), ENG(ME), ESPP, HIST, IEEC, IEM, LMS, MACS, MAEC, MAEO, MAT, MATH, MEEC, MEEC(DES), MEEC(RMS), MS, MS-2ndMaj/Spec(MSB), MTEC, PHSC, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "prerequisite": "BS2004", "grade_type": null}, "BU8101": {"name": "ACCOUNTING: A USER PERSPECTIVE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1101, AC1101, AC1103, AD1101, AD2101, EE0062, EE8062", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "The objective of this course is to expose non-accounting and non-business students to the environment of accounting and its role in providing information for useful decision making by various stakeholders of business organizations. By the end of the course, students should be able to appreciate the role, scope and value of information for managing business organizations towards achieving their goals.Students will learn fundamental concepts and techniques in financial and managerial accounting through solving business problems. In this course, students are treated to an understanding of a broad range of the underlying accounting concepts without the need to be involved in too much detail associated with the processes. Whilst non-accounting and non-business students need not have to prepare detailed financial statements, it would be beneficial for them to be able to understand, interpret, analyze and use them.Topics covered include - the role of accounting in business; the accounting cycle; understanding, interpretation and analysis of financial statements; and the application of accounting tools for strategic planning and control in a business organization."}, "BU8201": {"name": "BUSINESS FINANCE", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1201", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "This is an introductory course in finance for non-business and non-accounting students, which provides students with a broad understanding of the principles and practice of Business Finance/Financial Management.   The emphasis is on the major financial decisions made by companies and the valuation of investments made by them.  The course starts by examining the various forms of businesses and the importance of interest rates.  Time value of money, and the linkage between risk and return, lays the foundation for evaluating the price of bonds and stocks.  Students will learn and apply principles of capital budgeting (calculating the profitability of various projects and deciding which one to proceed) and capital structure (financing approved projects by issuing shares or bonds, or using retained earnings).  The decision to use extra cash to pay dividends or repurchase shares will be analysed and the course concludes with the use of derivatives to protect and enhance the value of firms.Students intending to take this course should be numerate (good and comfortable with mathematical calculations and formulas) e.g. they should know well compound interest calculations, Sum of Geometric Progression (G.P.) calculation before attending this course.  "}, "BU8301": {"name": "FUNDAMENTALS OF BUSINESS LAW", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1301", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "The aim of this course is to provide an understanding and appreciation of the law relating to business. As an introductory elective course, it will cover the main legal principles and issues. Topics ranging from the formation of contract to the terms of contracts to termination of contract will be covered together with the topics of agency, business organizations, tort and intellectual property. This course hopes to equip students with an awareness of the main principles of law relating to business transactions and the legal methodology and analysis skills for the same. Students will thus understand how law and business transactions inter-relate and will gain a better understanding of the legal issues which affect businesses."}, "BU8501": {"name": "MARKETING FOR THE 21ST CENTURY", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1501", "not_available": "ACBS, ACC, BCE, BCG, BUS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "This course is designed for students who have chosen to specialise in disciplines other than business. As students may already know, a working knowledge of marketing is rather useful wherever their career takes them. We will discuss the basic principles of marketing. However, the focus is on its practice and how this understanding could potentially enhance the students' future performance in their chosen field. A hands-on approach is expected of students and activities have been incorporated to encourage observation and enhance analytical ability. The course will require you to analyse businesses, lead discussions and present your analysis and recommendations on selected organisations."}, "BU8601": {"name": "FUNDAMENTALS OF MANAGEMENT", "au": "  3.0", "program": "BUS", "mutually_exclusive": "AB1601, BE2601", "not_available": "ACBS, ACC, BCE, BCG, BUS, MAEO(BA), MAEO(NULL), MATH(BA), MATH(NULL), MS, MS-2ndMaj/Spec(MSB)", "prerequisite": null, "grade_type": null, "not_available_spec": "2nd Maj/Spec(ACC), 2nd Maj/Spec(BAF), 2nd Maj/Spec(BAT), 2nd Maj/Spec(BUS), 2nd Maj/Spec(ITG), 2nd Maj/Spec(MKG), 2nd Maj/Spec(OM)", "description": "To function in an organisation, technical skills by themselves are insufficient; they have to be supplemented by management training.  Success in an organisation depends as much on general management skills and understanding operational systems as on technical expertise.  Hence, students need a firm foundation in management skills.  This course is designed for non-business students and aims to equip them with the knowledge, skills and competence in various aspects of management, including: the role of management and managers; decision-making, planning and strategy; managing organisational architecture; managing individuals and groups; and controlling critical organisational processes."}, "CE3005": {"name": "COMPUTER NETWORKS", "au": "  3.0", "program": "CE", "mutually_exclusive": "CZ3006", "not_available": "BCG, CSC, CSEC", "prerequisite": "CE1008 OR CZ1008 OR CE1011 & CE1012 OR CZ1011 & CZ1012", "grade_type": null}, "CS2054": {"name": "INTERPERSONAL COMMUNICATION", "au": "  3.0", "program": "CS", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course examines major theoretical perspectives and concepts relevant to interpersonal communication in personal relationships. These relationships include the everyday associations we have with others as a result of the positions we occupy in various situations, as well as the more intimate relationships we form with select others (friendships, family relationships, and sexual relationships). The knowledge gained from this class will help students better understand themselves and their relationships with people around them."}, "CS4032": {"name": "COMMUNICATION CAMPAIGNS", "au": "  4.0", "program": "CS", "mutually_exclusive": null, "not_available": null, "prerequisite": "CS2058", "grade_type": null, "not_available_spec": " Yr1", "description": "The focus of this course is on the creation, production, performance, and dissemination of various forms of publicity to support a range of comprehensive communication campaigns. It covers print and audiovisual media and the activities of government and non-profit organisations as well as private corporations.  The course is organised around a client project.  The proposed campaign will require that students to do some basic consumer research, develop a positioning strategy, create original advertising and other marketing communication materials, develop a media plan, and put all of these elements into a written plan and presentation for the client as if they were \"pitching\" for an account."}, "CZ3006": {"name": "NET CENTRIC COMPUTING", "au": "  3.0", "program": "CSC(CE)", "mutually_exclusive": "CE3005", "not_available": "BCE, CE, CEEC", "prerequisite": "CZ1006 & CZ2002 OR CE1006 & CE2002", "grade_type": null, "description": ""}, "CZ3007": {"name": "COMPILER TECHNIQUES", "au": "  3.0", "program": "CSC(CE)", "mutually_exclusive": null, "not_available": null, "prerequisite": "CZ2001 & CZ2006 OR CE2001 & CE2006", "grade_type": null, "description": ""}, "HE2011": {"name": "LABOUR ECONOMICS & LABOUR RELATIONS", "au": "  3.0", "program": "ECON(SSS)", "mutually_exclusive": null, "not_available": null, "prerequisite": "HE1001 OR HE9091 OR AB0901", "grade_type": null, "description": "It covers the determination of labor market demand and supply, wage determination, wage differentials, human capital investment, migration and discrimination, as well as unemployment and labor policies."}, "HE4013": {"name": "EXPERIMENTAL ECONOMICS", "au": "  4.0", "program": "ECON(SSS)", "mutually_exclusive": null, "not_available": null, "prerequisite": "HE2001", "grade_type": null, "description": "This course introduces the methodology of experimental economics and its application to specific topics. The main themes are:1.\tDesigning economic experiments2.\tConducting economic experiments3.\tAnalysing experimental data4.\tApplications to time preferences, risk preferences, and social preferences"}, "EE1002": {"name": "PHYSICS FOUNDATION FOR ELECTRICAL & ELECTRONIC ENGINEERING", "au": "  4.0", "program": "EEE", "mutually_exclusive": "CY1306, EE2091, FE1002, PH1105, PH1106, PH116S", "not_available": null, "prerequisite": "PH1011 OR PH1012", "grade_type": null, "not_available_spec": "", "description": "This course aims to build a strong foundation in the relevant physics principles used in the design of common electrical and electronic devices. The course builds on the concepts learned in the common engineering curriculum's first semester physics course. This course focuses on fundamental concepts that are key to EEE students in preparation for subsequent studies, and are utilized daily by electrical and electronics engineering professionals. You will learn the relationship between physics concepts and their applications in EEE. Contents: Introduction of electromagnetic fields and applications. Electromagnetic in electronics, circuits and communications. Introduction to light and principles of geometric optics. Principles of wave optics. Introduction to quantum physics and applications. Applications of quantum physics in electronics and lasers."}, "EE1005": {"name": "FROM COMPUTATIONAL THINKING TO PROGRAMMING", "au": "  3.0", "program": "EEE", "mutually_exclusive": "CE1003, CV1014, CZ1003, FE1008, MA1008", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": "", "description": "Course Overview and Concepts of Computational Thinking.  Overview of Programming Languages. Computers and Programming.  Overview of a Computer Program and Data Types. CT to Programming Concept - Operations and Reusable Functions. CT to Programming Concept - Decision Making and Repetition. CT to Programming Concept - Functions and Decomposition to Smaller Modules. CT to Programming Concept - Advanced Data Structures.  Computing Trends.  Social-Ethical Issues and Ramifications of Computing. "}, "EE2002": {"name": "ANALOG ELECTRONICS", "au": "  4.0", "program": "EEE", "mutually_exclusive": null, "not_available": null, "prerequisite": "EE2001", "grade_type": null, "description": "Diode circuit analysis.   Bipolar junction transistors. MOSFET devices. Small-signal amplifiers. Multistage and differential amplifiers. Current Sources and Current Mirrors. Frequency response.  Operational amplifiers. Applications."}, "EE2007": {"name": "ENGINEERING MATHEMATICS II", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2007", "not_available": null, "prerequisite": "MH1811 OR MH2810 OR CY1602", "grade_type": null}, "EE2008": {"name": "DATA STRUCTURES & ALGORITHMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM1001", "not_available": "REP(ASEN), REP(BIE), REP(CBE), REP(CE), REP(CSC), REP(CVEN), REP(ENE), REP(MAT), REP(ME)", "prerequisite": null, "grade_type": null, "description": "This course aims to give a systematic introduction to data structures and algorithms for constructing efficient computer programs. Emphasis is on data abstraction issues in program development process, and on the design of efficient algorithms. Simple algorithmic paradigms such as greedy algorithms, divide-and-conquer algorithms and dynamic programming will be introduced. Elementary analyses of algorithmic complexities will also be taught. Contents: Introduction. Principles of algorithm analysis. Data structures. Search Trees. Sorting. Searching. Algorithm design techniques."}, "EE2010": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2004", "not_available": null, "prerequisite": "MH1810 & MH1811 OR MH2810 OR CY1601 & CY1602", "grade_type": null, "description": "Through this course, students should be able to understand the representation of continuous-time and discrete-time signals; their frequency characteristics and Fourier spectrum; representation and characteristics of linear time-invariant systems in both time and frequency domains; and the principles of sampling a continuous-time signal to yield a discrete-time one. Contents: Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "EE3001": {"name": "ENGINEERING ELECTROMAGNETICS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "PH2102", "not_available": null, "prerequisite": "EE2007(Corequisite)", "grade_type": null, "description": "This course aims to develop your understanding of the fundamental principles underlying the theory of electromagnetic fields and waves and your ability to apply this theory to the solution of engineering problems, e.g. solving fields, charges, currents and voltages in electrostatic, magnetostatic and electromagnetic problems. Contents: Static electric and magnetic fields. Maxwell's equations. Wave equation and uniform plane waves. Electromagnetic energy transfer. Reflection of electro-magnetic waves. Transmission lines."}, "EE3002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "EEE", "mutually_exclusive": "IM2002, MP3006", "not_available": null, "prerequisite": null, "grade_type": null}, "EE3080": {"name": "DESIGN & INNOVATION PROJECT", "au": "  2.0", "program": "EEE", "mutually_exclusive": "EE2079, IM3080", "not_available": null, "prerequisite": "EEE3 standing", "grade_type": null, "description": "The aim of the Design and Innovative Project module is to introduce you to design, prototype and test electrical and electronic engineering projects. It provide you an opportunity to exercise your creative and innovative ideas in a group project environment and excite the imagination of aspiring engineers, innovators and technopreneurs.Contents: Project Charter. Lectures on project management. Design and prototype development. Testing and instrumentation. Project report. Oral Presentation. Demonstration. DIP Competition."}, "HH4092": {"name": "SPECIAL TOPICS IN HISTORY- WORLD HISTORY", "au": "  4.0", "program": "HIST(SOH)", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": " Yr1", "description": "War, as a quintessential part of social existence, attracts scholarship from the humanities and social sciences on issues directly or indirectly related to military conflict. Students of history are not exempt from this study as they conduct research on topics ranging from the military conflicts themselves to their long term impacts. However, the theories behind the actions taken during military conflicts remain a field of study of a niche group of military professionals and strategy researchers only. This situation creates a gap in the theoretical understanding of these military conflicts outside of this niche group. This courses seeks to close this theoretical gap and to explain the theories of modern military conflict from the Napoleonic era to contemporary, through the medium of war movies.  Using some of the 20th and 21st century's most iconic war films as a tool will aid student understanding in translating these often complex and abstract theories into practical applications."}, "IM1001": {"name": "DATA STRUCTURES & ALGORITHMS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2008", "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to give a systematic introduction to data structures and algorithms for constructing efficient computer programs. Emphasis is on data abstraction issues in program development process, and on the design of efficient algorithms. Simple algorithmic paradigms such as greedy algorithms, divide-and-conquer algorithms and dynamic programming will be introduced. Elementary analyses of algorithmic complexities will also be taught.Course content: Introduction. Principles of Algorithm Analysis. Data Structures. Search Trees. Sorting. Searching. Algorithm Design Techniques."}, "IM2002": {"name": "MICROPROCESSORS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE3002, MP3006", "not_available": null, "prerequisite": null, "grade_type": null, "description": "Introduction to ARM core and programmer's model. Assembler Directives. Loads, Stores and Addressing. Logic and Arithmetic. Flow control instructions. Subroutines, Stacks and Exception Handling. Thumb Instructions and C language. Peripherals Interfacing."}, "IM2004": {"name": "SIGNALS & SYSTEMS", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2010", "not_available": null, "prerequisite": "IM2092 OR MH1810 & MH1811 OR MH2810", "grade_type": null, "description": "Through this course, students should be able to understand the representation of continuous-time and discrete-time signals; their frequency characteristics and Fourier spectrum; representation and characteristics of linear time-invariant systems in both time and frequency domains; and the principles of sampling a continuous-time signal to yield a discrete-time one.Course content: Signals and Systems. Linear Time-Invariant Systems. Fourier Representation of Signals and LTI Systems. Sampling. Modulation."}, "IM2007": {"name": "ENGINEERING MATHEMATICS II", "au": "  4.0", "program": "IEM(EEE)", "mutually_exclusive": "EE2007", "not_available": null, "prerequisite": "MH1811 OR MH2810", "grade_type": null, "description": "Linear Algebra. Complex Variables. Vector Differential Calculus. Vector Integral Calculus."}, "IM3080": {"name": "DESIGN & INNOVATION PROJECT", "au": "  2.0", "program": "IEM(EEE)", "mutually_exclusive": "EE3080, IM2079", "not_available": null, "prerequisite": "Year 3 Class", "grade_type": null, "description": "Project Proposal, Lectures on Project Management, Project Implementation, Project Report, Oral Presentation,Design and Innovation Competition."}, "HG2096": {"name": "WHAT'S IN A TEXT? - ANALYZING WRITTEN DISCOURSE", "au": "  3.0", "program": "LMS(SOH)", "mutually_exclusive": null, "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course will start by introducing and discussing the notions of `discourse' and `discourse analysis', after which the long-standing debate on difference between speech and writing will be examined. Given the importance of writing and written communication in the contemporary world, writing will be elaborated upon as a topic worthy of scientific enquiry, particularly with reference to different technologies and media, both `old' and `new'. One week will be devoted to an overview of different scripts and writing systems around the world, and examination how (and why) they can (and should) be studied as important semiotic resources for meaning-making and textual production. We will then move on to review and assess different types of written discourse and different ways to analyze them. After each of these segments, students will be expected to work on relevant assignments in order to get hands-on experience with working with written discourse. Finally, we will address some of the practicalities of analyzing written discourse and examine a number of examples of how written discourse analysis can be used by non linguists whose primary research questions are not about language and language use."}, "MH1812": {"name": "DISCRETE MATHEMATICS", "au": "  3.0", "program": "MATH(SPS)", "mutually_exclusive": "CE1001, CZ1001", "not_available": null, "prerequisite": null, "grade_type": null, "not_available_spec": "", "description": "Elementary Number Theory; Propositional Logic; Sets; Predicate Logic; Linear Recurrence Relation; Relations and Functions; Graphs; Complex Numbers; Vectors and Matrices; Elementary Combinatorics."}, "MA2002": {"name": "THEORY OF MECHANISM", "au": "  3.0", "program": "ME", "mutually_exclusive": "MP2002", "not_available": "ACBS, ACC, ADM, ARED, BCE, BCG, BEEC, BIE, BMS, BS, BSB, BSPY, BUS, CBE, CBEC, CE, CEE, CEEC, CHEM, CHIN, CS, CSC, CSEC, CVEC, DSAI, ECMA, ECON, ECPP, ECPS, EEE, EEEC, EESS, ELAH, ELH, ENE, ENEC, ENG, ESPP, HIST, IEEC, IEM, LMS, MACS, MAEC, MAEO, MAT, MATH, MS, MS-2ndMaj/Spec(MSB), MTEC, PHIL, PHY, PPGA, PSLM, PSMA, PSY, SCED, SOC, SSM", "prerequisite": "MA1001", "grade_type": null, "description": "The purpose of a mechanism is to transmit motion and force. This course introduces the students some basic mechanisms including linkages, cams and gears. Mechanisms are the building blocks of a machine. In a machine design problem, very often the first task is to determine the type and configurations of mechanisms to provide the desired motions. Once the kinematic issues are addressed, the dynamic analysis can then be performed. In this course, techniques for the kinematic and dynamic analyses of mechanisms will be covered. A course in the theory of mechanisms is essential for any mechanical engineers as the knowledge is fundamental in understanding the working of machines. Apart from analytical ability, it also provides students the opportunities to develop their design capability."}, "MA3003": {"name": "HEAT TRANSFER", "au": "  3.0", "program": "ME", "mutually_exclusive": "AE3003, MP3003", "not_available": "ME(2015-onwards), ME(DES)(2012-onwards)(Non Direct Entry), ME(DES)(2013-onwards)(Direct Entry), ME(RMS)(2012-onwards)(Non Direct Entry), ME(RMS)(2013-onwards)(Direct Entry)", "prerequisite": "MA2007", "grade_type": null, "description": "A comprehensive knowledge of heat transfer is essential to the training of a mechanical engineer in our knowledge-based economy.  As a first course on the subject, it covers the essential topics of heat transfer viz. one-dimensional, steady and unsteady heat conduction, extended surface heat transfer, convection fundamentals and applications, principles and methods of heat exchanger rating and design and radiation heat transfer analysis."}, "MA3004": {"name": "MATHEMATICAL METHODS IN ENGINEERING", "au": "  3.0", "program": "ME", "mutually_exclusive": null, "not_available": null, "prerequisite": "MH1810 & MH1811 OR CY1203 OR MH2812 OR CY1602 OR MH2810", "grade_type": null, "description": "This course covers introductory material on PDEs, FEM and CFD and is arranged in three parts. The first part covers classification of PDEs and typical analytical methods for solving them. The second part covers basic finite element concepts and typical applications in solid mechanics. The third part covers basic concepts in CFD with a focus on finite volume methods.   "}, "MA3006": {"name": "FLUID MECHANICS", "au": "  3.0", "program": "ME", "mutually_exclusive": "MP2005, MP2305", "not_available": null, "prerequisite": "MA2003", "grade_type": null, "description": "Momentum equation and its applications. Dimensional analysis and similitude. Internal flows and piping systems. Principles and applications of fluid machines."}, "ET9131": {"name": "VENTURING INTO ENTREPRENEURSHIP", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9101, ET9121, RE8001", "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to provide you with a fundamental understanding of the entrepreneurial process, of how entrepreneurs start and implement their business ideas and to instill in them an entrepreneurial mindset posture for the future. By immersing in activities relevant to entrepreneurship and value creation, you will discover and acquire one's entrepreneurial passion, motivation and mindset. You will be introduced to the concepts of entrepreneurship, innovation and new venture creation process. You, individually and collectively as a team, will learn to generate ideas, identify opportunities and investigate whether an idea can be turned into a viable business through a feasibility analysis."}, "ET9132": {"name": "NEW VENTURE FINANCING", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9102", "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course aims to help you to better appreciate the startup formation process, in particular, in securing proper venture financing to ringfence intellectual property intangibles, undertake product developments, talent acquisitions, market expansion and ultimately leading to a viable exit strategy for all stakeholders.  You will be able to understand the entrepreneurship development from a funding/financing viewpoint.  At the same time, You will gain insights on the investment perspectives from both the entrepreneurs and Venture Capital firms with respect to the funding cycles and expectations.  This course will clarify key financial concepts, accounting principles and market practices that will better equip aspiring entrepreneurs to secure funding for their new ventures.This course is suitable for those who are planning and currently involved in startup creation and would like to gain suitable skillsets on how to secure funding from different channels and sources."}, "ET9133": {"name": "MANAGING GROWING ENTERPRISES", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9103", "not_available": null, "prerequisite": "ET9131 & ET9132", "grade_type": null, "description": "The start-up and growth of an enterprise invariably involves both human and financial capital. To manage the increasing pool of human resources and to convince venture capitalists to invest become two main issues especially for growing ventures. This module consists of two parts: in the first part, organization and human resource management are introduced; in the second part, the focus is on writing a convincing business plan to attract venture capital investment. "}, "ET9134": {"name": "ENTERPRISE STRATEGY", "au": "  3.0", "program": "NTC", "mutually_exclusive": "ET9104, RE8009", "not_available": null, "prerequisite": "ET9131 & ET9132 & ET9133", "grade_type": null, "description": "This course aims to provide students a holistic approach towards the management of a company, from start-up phase to growth & expansion, where you would understand and learn to recognise and analyse an organisation as an integrated entity in achieving the company's objectives and strategies. In deliberating and executing some of the major business decisions that entrepreneurs face when growing their ventures and competing with other companies in the same industry, you will broaden and deepen your analytical skills when assessing the correlational impact across the organisation instead of viewing each functional activity as a standalone.Through the use of a business simulator software platform, you will be immersed in and experience the process of managing a business. You will form groups with your peers to compete with one another. As you work through the organization's life cycle in the simulation, external forces and real-world managerial dilemmas are added to test your responsiveness and abilities to deal with uncertainties."}, "HY8001": {"name": "PHILOSOPHY FOR EVERYONE", "au": "  3.0", "program": "PHIL(SOH)", "mutually_exclusive": "HY9001", "not_available": null, "prerequisite": null, "grade_type": null, "description": "This course covers a broad range of perennial philosophical issues in metaphysics, epistemology, aesthetics, logic, social philosophy, political philosophy, and ethics. It may also covers some specialized subjects such as philosophy of special sciences, philosophy of religion, and philosophy of technology."}, "HA4065": {"name": "THE PRACTICE OF INTERNATIONAL RELATIONS", "au": "  4.0", "program": "PPGA(SSS)", "mutually_exclusive": null, "not_available": null, "prerequisite": "HA1001 & HA1012", "grade_type": null, "description": "This course introduces you to foreign affairs through a series of simulations, discussions where you will become acquainted with the practice of statecraft and diplomacy on a practical level. From the perspective of policymakers, we will tackle several of the most pressing issues in contemporary international security, ranging from traditional security issues like inter-state and civil war, nuclear proliferation, and the rise of great powers to more non-traditional, newer issues like terrorism, climate change, and 'human security.'  You will explore the intricacies, challenges, and possibilities of diplomacy during international crises through an active learning approach using simulations."}}